[
    {
        "courseNumber": "180779",
        "semesterCode": "2020S",
        "courseType": "SE",
        "title": {
            "de": "Seminar für Diplomand_innen für Wirtschaftsinformatik",
            "en": "Seminar for Master Students in Business Informatics"
        },
        "objective": {
            "de": "<p>-</p>",
            "en": "<p>-</p>"
        },
        "teachingContent": {
            "de": "<p><span>Dieses Seminar ist Pflicht für alle Studierenden des Master Business Informatics, die nicht mehr gemäß Übergangsregelungen nach dem alten Modus mit dem Seminar 188.967 abschließen.</span></p> \n<p><span>Vorträge der DiplomandInnen über Proposal und Ergebnisse ihrer Diplomarbeiten.</span></p>",
            "en": "<p>This seminar is mandatory for all students of the Master Business Informatics who are not able to finish their studies in the old mode with the Seminar4Master 188.967.</p> \n<p>&nbsp;P<span>resentations of master thesis proposal and final results of the master thesis.</span></p>"
        },
        "additionalInformation": {
            "de": "<p><span>Beachten Sie beim Verfassen der Ausarbeitung bitte die Richtlinie der TU Wien zum Umgang mit Plagiaten: </span><a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf</a></p> \n<p>&nbsp;</p> \n<p><br>Beachten Sie beim Verfassen der Ausarbeitung bitte die Richtlinie der TU Wien zum Umgang mit Plagiaten: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf</a></p>",
            "en": "<p><span>Please consider the plagiarism guidelines of TU Wien when writing your seminar paper: </span><a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf</a></p> \n<p>&nbsp;</p> \n<p><br>Please consider the plagiarism guidelines of TU Wien when writing your seminar paper: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf</a></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Bewertung der beiden Präsentationen und des Reviews.</p>",
            "en": "<p>Assessment&nbsp; of both presentations and of the review.</p>"
        },
        "related": {
            "recommendation": {
                "de": "<p>Die Studierenden sollten idealerweise im Semester davor SE Research Methods absolviert haben. Jedenfalls sollten Studierende vor ihrer Proposal Präsentation alle Methodenvorträge aus Research Methods gehört haben.</p>",
                "en": "<p>Students are expected to have passed the seminar on research methods in the previous semester. Before presenting their own proposal students should have at least visited all method presentations of SE Research Methods.</p>"
            }
        },
        "weeklyHours": "1.0",
        "lecturers": {
            "oid": [
                "3365713",
                "1329125",
                "2619281"
            ]
        },
        "tutors": null,
        "instituteCode": "E180",
        "instituteName": {
            "de": "Fakultät für Informatik",
            "en": "Faculty of Informatics"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=180779&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "NONE",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=180779-2020S",
        "language": {
            "de": "Englisch",
            "en": "English"
        }
    },
    {
        "courseNumber": "188391",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Objektorientierte Modellierung",
            "en": "Object-oriented modeling"
        },
        "objective": {
            "de": "<p>Ziel dieser Lehrveranstaltung ist es, den Studenten einen fundierten Überblick über die Modellierungskonzepte der Unified Modeling Language (UML) zu geben. Die behandelten Themen umfassen:</p> \n<p>- Modellbegriff und Modellierungsbegriff<br>- Objektorientierte Konzepte<br>- Objektorientierte Anforderungsspezifikation<br>- Analyse und Entwurf von Softwaresystemen<br>- Objektorientierte Modellierung anhand von UML (Klassendiagramm, Sequenzdiagramm, Zustandsdiagramm, Aktivitätsdiagramm, Anwendungsfalldiagramm)</p>",
            "en": "<p>The goal of this course is to give students a profound understanding of modeling using the Unified Modeling Language (UML). Thereby the lecture will focus on the following topics: object oriented concepts, object oriented requirements specification, analysis and design of software systems, and object oriented modeling using UML.</p>"
        },
        "teachingContent": {
            "de": "<p>Als Modellierungstechniken werden folgende Diagramme von UML2 angewendet:<br><br>- Klassendiagramm<br>- Sequenzdiagramm<br>- Zustandsdiagramm<br>- Aktivitätsdiagramm<br>- Anwendungsfalldiagramm</p>",
            "en": "<p>The following UML modeling techniques will be used throughout the course:<br><br>- Class diagram<br>- Sequence diagram<br>- State diagram<br>- Activity diagram<br>- Use case diagram</p>"
        },
        "additionalInformation": {
            "de": "<p>Link zum GoTo Meeting für die Übung:&nbsp;https://www.gotomeet.me/TUW-OOM</p> \n<p>Fragen bitte an: oom[at]big.tuwien.ac.at<br><br>Zu Beginn des Semesters ist in Tuwel ein Einstiegstest zu absolvieren (bis 09.03.2020), der Voraussetzung für die Teilnahme an der LVA ist.<br><br>Sie finden alle notwendigen Informationen und alle Unterlagen zur LVA im Tuwel-Kurs!<br><br>Die theoretischen Inhalte der Lehrveranstaltung werden mit Vorlesungsvideos vermittelt. In \"Beispielstunden\" werden Fragen zu den Inhalten der Videos beantwortet und die praktische Lösung von Beispielen wird demonstriert.<br><br>Vorlesungstermine/Beispielstunden, 15-17 Uhr, AudiMax:<br><br>03.03.: Vorbesprechung<br>10.03.: Klassendiagramm<br>17.03.: Sequenzdiagramm<br>24.03.: Zustandsdiagramm<br>31.03.: Aktivitätsdiagramm<br>21.04: Anwendungsfalldiagramm<br>(bei den Beispielstunden gibt es keine Anwesenheitspflicht)</p> \n<p>Die 6 Übungstermine finden in folgenden Wochen statt:<br><br>16.-19.03., 23.-26.03., 30.3.-02.04., 20.-23.04., 27.-30.4. und 04.-07.05. (In den anderen Wochen ist kein Übungsbetrieb!)<br><br>Sie müssen sich sowohl zur Lehrveranstaltung als auch zu einer der Übungsgruppen anmelden.<br><br>Es sind zwei Anmeldungen erforderlich!<br><br>Hinweis: Es gibt insgesamt 6 Übungsblätter zu je 6 Beispielen. Zu jedem der Übungsblätter gibt es eine Übungseinheit, die als \"Kreuzerlübung\" (wie in der Mathematik) abgehalten wird. Dabei müssen Sie insgesamt zumindest 24 Beispiele kreuzen (und dann auch in der Übung anwesend sein). Näheres dazu erfahren Sie in der Vorbesprechung!<br><br>Es ist nicht möglich, die Beispiele in einer anderen Gruppe zu kreuzen/präsentieren, als in der, in der Sie sich angemeldet haben!<br><br>Aufwand für Studierende:<br><br>&nbsp; 1 h Vorbesprechung<br>&nbsp; 8 h Vorlesungsvideos<br>7,5 h Beispielstunden (5 x 1,5 h)<br>&nbsp; 9 h Übung (6 x 1,5 h)<br>&nbsp;27 h Vorbereitung Übung (6 x 6 x 0,75 h)<br>1,5 h Tests (3 x 0,5 h)<br>&nbsp;21 h Vorbereitung Tests (3 x 7,0 h)<br>-----------------------------------------<br>&nbsp;75 h = 3 ECTS</p>",
            "en": "<p>Link to GoTo Meeting for the Exercises:&nbsp;https://www.gotomeet.me/TUW-OOM</p> \n<p>Address your questions to: oom[at]big.tuwien.ac.at<br><br>All necessary information will be provided in the TUWEL-course of <br><br>this lecture.<br><br>All theoretical content is taught via lecture videos. There are <br><br>lectures where questions concerning the content of the videos <br><br>will be answered and practical solutions of the examples will be <br><br>demonstrated.<br><br>Dates (3-5 p.m., AudiMax):<br><br>March 3: Prediscussion/Introduction<br>March 10: class diagram<br>March 17: sequence diagram<br>March 24: state diagram (Tuesday!)<br>March 31: activity diagram<br>April 21: use case diagram<br><br>The labs take place in the following weeks:<br><br>March 16-19, March 23-26, March 30-April 2, April 20-23, April 27-30, und May 4-7.<br><br>You have to apply for the course and for one of the lab groups.<br><br>Both registrations are mandatory to attend the course!<br><br>Note: There are 6 assignments with 6 exercises each. For each <br><br>lecture there will be a dedicated lab lesson. Before each lesson <br><br>you have to mark in TUWEL which exercises you have solved and you <br><br>can therefore present in the lab. You have to solve at least 24 <br><br>(out of 36) exercises. Further information will be provided in <br><br>the prediscussion / first lecture.<br><br>You have to present your solved exercises in your designated lab <br><br>group. It is not possible to present your assignments in another <br><br>lab group to which you are not assigned to!<br><br>student efforts:<br><br>&nbsp; 1 h Preliminary talk<br>&nbsp; 8 h Lecture videos<br>7,5 h Example lectures (5 x 1,5 h)<br>&nbsp; 9 h Lab sessions (6 x 1,5 h)<br>&nbsp;27 h Exercise preparation (6 x 6 x 0,75 h)<br>1,5 h Tests (3 x 0,5 h)<br>&nbsp;21 h Test preparation (3 x 7,0 h)<br>-------------------------------------------<br>75 h = 3 ECTS</p>"
        },
        "lectureNotes": {
            "de": "<p>alle Unterlagen zur LVA finden Sie im Tuwel-Kurs.</p>",
            "en": "<p>all course material can be found in the tuwel-course.</p>"
        },
        "examinationModalities": {
            "de": "<p>Zu Beginn des Semesters ist in Tuwel ein Einstiegstest zu absolvieren (bis 09.03.2020), der Voraussetzung für die Teilnahme an der LVA ist. Für eine positive Beurteilung der LVA ist es notwendig, mind. 2/3 der Beispiele zu lösen und diese in den Übungseinheiten präsentieren zu können. Weiters gibt es über das Semester verteilt drei Tests, jeweils zu den Themen der Vorlesungs- bzw. Übungseinheiten. Diese sind verpflichtend. Einer der drei Tests kann am Semesterende nachgemacht bzw. wiederholt werden.</p>",
            "en": "<p>At the beginning of the term, as a precondition to attend the course, the entry-test in TUWEL has to be passed until March 9, 2020. In order to pass the course successfully it is necessary to solve at least 2/3 of all assigned examples and to be able to present them during the lab. Furthermore there will be three mandatory written exams throughout the term. One of the three tests may be repeated at the end of the term.</p>"
        },
        "related": {
            "recommendation": {
                "de": "<p>grundlegendes algorithmisches Verständnis (Programmieren 1)</p>",
                "en": "<p>programming skills</p>"
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "3686765",
                "1329125",
                "1442505",
                "3365713",
                "2440365"
            ]
        },
        "tutors": {
            "oid": [
                "22595837",
                "18050709",
                "11916097",
                "17783001",
                "14078593",
                "17915893",
                "15486789",
                "18050357",
                "10188993"
            ]
        },
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=188391&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?id=18982",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "188416",
        "semesterCode": "2020S",
        "courseType": "PR",
        "title": {
            "de": "Freifachpraktikum",
            "en": "Informatics Lab (Freifachpraktikum)"
        },
        "objective": {
            "de": "<p>Ziel dieser Lehrveranstaltung ist die praktische Erfahrung in der Anwendung der verschiedenen Verfahren und Methoden der Wirtschaftsinformatik. Die Durchführung des Praktikums kann optional in Zusammenarbeit mit Wirtschaftspartnern erfolgen. Dies ist jedoch unbedingt vor Beginn des Praktikums mit der LVA-Leitung abzusprechen.</p>",
            "en": "<p>The goal of this course is the practical application of research topics of the Business Informatics Group. Coursework will include the collection of related business problems, identification of optimization possibilities, and the potential application in IT systems. Optionally the work can be conducted in cooperation with an industry partner. If you would like to accomplish your lab in cooperation with an external partner, please inform your advisor in advance.</p>"
        },
        "teachingContent": {
            "de": "<p>Im Rahmen der Lehrveranstaltung setzen Sie eine konkrete Aufgabenstellung beginnend von der groben Anforderungsbeschreibung bis hin zur prototypischen Realisierung um. Dabei können Praktika zum Beispiel folgende Bereiche abdecken: Requirements Engineering, Prozessoptimierung, Design, Entwurf und prototypische Implementierung. Der konkrete Umfang Ihres Praktikums wird gemeinsam mit der LVA Leitung festgelegt und hängt vom gewählten Thema, der Themenkomplexität und der Gruppengröße ab.</p> \n<p><a href=\"http://www.big.tuwien.ac.at/teaching/info.html?locale=en\" rel=\"nofollow\">Formatvorlagen und Richtlinien</a></p> \n<p><a href=\"http://www.big.tuwien.ac.at/teaching/practicals.html?locale=en\" rel=\"nofollow\">Aktuelle Praktikumsthemen der Business Informatics Group</a></p>",
            "en": "<p>During the course of this lab students will realize a practical assignment beginning with a coarse-grained requirements definition culminating in a final prototypical realization. Potential topics include but are not limited to requirements analysis, process optimization, design, implementation, and prototypical realization. The exact definition of your lab assignment will be done together with your advisor and depends on the chosen topic, the topic's complexity, and the size of your team (if you are working in one).</p> \n<p><a href=\"http://www.big.tuwien.ac.at/teaching/info.html?locale=en\" rel=\"nofollow\">Templates and Guidelines</a></p> \n<p><a href=\"http://www.big.tuwien.ac.at/teaching/practicals.html?locale=en\" rel=\"nofollow\">Current lab assignment topics of the Business Informatics Group</a></p>"
        },
        "additionalInformation": {
            "de": "<p>Aufwand für Studierende:</p> \n<pre>&nbsp; 2 h Vorbesprechung<br>&nbsp;20 h Pflichtenheft<br>&nbsp;40 h Analyse und Entwurf<br>&nbsp;40 h Implementierung<br>&nbsp;24 h Dokumentation (Systemhandbuch, Benutzerhandbuch)<br>&nbsp;10 h Vorbereitung der Präsentation<br>&nbsp; 2 h Präsentation<br>&nbsp;12 h Laufende Besprechungen<br>-----------------------------------------------------------------------------<br>150 h = 6 ECTS</pre>",
            "en": "<pre>Effort for the student:<br><br>  2 h Preliminary Talk<br> 20 h Requirements Engineering<br> 40 h Analysis and Design<br> 40 h Implementation<br> 24 h Documentation (System Manual, User Manual)<br> 10 h Preparing Presentation<br> &nbsp;2 h Presentation<br> 12 h Regular Meetings<br>-----------------------------------------------<br>150 h = 6 ECTS</pre>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Studierende werden aufgrund der Qualität der praktischen Implementierung und deren Dokumentation beurteilt</p>",
            "en": "<p>Students are graded based on the quality of the implementation of the prototype system and its documentation.</p>"
        },
        "related": {
            "recommendation": {
                "de": "<p>Individuell nach Themenstellung.</p>",
                "en": "<p>Depending on the chosen topic.</p>"
            }
        },
        "weeklyHours": "4.0",
        "lecturers": {
            "oid": [
                "1329125",
                "3365713",
                "1026725"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=188416&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "EXTERNAL",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=188416-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "188445",
        "semesterCode": "2020S",
        "courseType": "SE",
        "title": {
            "de": "Seminar für DiplomandInnen",
            "en": "Seminar for Master Students"
        },
        "objective": {
            "de": "<p>Präsentation der Fortschritte der eigenen Diplomarbeit. Kennenlernen der anderen Diplomarbeiten des Arbeitsbereichs.</p>",
            "en": "<p>During this seminar students will present the current progress of their diploma thesis related research. Every student will give a presentation of her or his research topic for the other students attending the course.</p>"
        },
        "teachingContent": {
            "de": "<p>Vorträge der DiplomandInnen über Problemstellung und Ergebnisse ihrer Diplomarbeiten.</p> \n<p><a href=\"https://big.tuwien.ac.at/teaching/masters-theses/diploma-seminars/\" rel=\"nofollow\">Aktuelle Vorträge und Termine</a></p> \n<p>Für eine Liste der zu verwendenen Richtlinien und Vorlagen besuchen Sie bitte die Webseite der <a href=\"http://www.big.tuwien.ac.at/teaching/info.html?locale=en\" rel=\"nofollow\">Business Informatics Group</a>.</p>",
            "en": "<p>Presentations of problem descriptions and results of the various diploma theses topics.</p> \n<p><a href=\"https://big.tuwien.ac.at/teaching/masters-theses/diploma-seminars/\" rel=\"nofollow\">List of current presentations, times, and venues</a></p> \n<p>For a list of guidelines and document templates please see the website of the <a href=\"http://www.big.tuwien.ac.at/teaching/info.html?locale=en\" rel=\"nofollow\">Business Informatics Group</a>.</p>"
        },
        "additionalInformation": {
            "de": "<p>Aufwand für Studierende:</p> \n<pre>3 x 3 h = 9 h Teilnahme an 3 Blöcken<br>         20 h Vorbereitung Erstvortrag<br>         20 h Vorbereitung Zweitvortrag<br>         26 h Reflexion der Ergebnisse<br>-----------------------------------------------<br>         75 h = 3 ECTS<br><br></pre> \n<p><br>Beachten Sie beim Verfassen der Ausarbeitung bitte die Richtlinie der TU Wien zum Umgang mit Plagiaten: <a href=\"https://www.tuwien.ac.at/fileadmin/t/ukanzlei/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf\" rel=\"nofollow\">https://www.tuwien.ac.at/fileadmin/t/ukanzlei/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf</a></p> \n<p><br>Beachten Sie beim Verfassen der Ausarbeitung bitte die Richtlinie der TU Wien zum Umgang mit Plagiaten: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf</a></p>",
            "en": "<p>Effort for the student:</p> \n<pre>3 x 3 hrs = 9 h Participation in 3 Units<br>           20 h Preparing Presentation on Master Proposal<br>           20 h Preparing Final Presentation<br>           25 h Reflection of Results<br>-----------------------------------------------</pre> \n<pre>           75 h = 3 ECTS<br><br></pre> \n<p><br>Please consider the plagiarism guidelines of TU Wien when writing your seminar paper: <a href=\"http://www.tuwien.ac.at/fileadmin/t/ukanzlei/t-ukanzlei-english/Plagiarism.pdf\" rel=\"nofollow\">http://www.tuwien.ac.at/fileadmin/t/ukanzlei/t-ukanzlei-english/Plagiarism.pdf</a></p> \n<p><br>Please consider the plagiarism guidelines of TU Wien when writing your seminar paper: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf</a></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Beurteilung der Präsentationen zur Masterarbeit und der damit verbundenen Fragenbeantwortung.</p>",
            "en": "<p>Assessment of the presentations on the master thesis and the anser given on related questions.</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1329125",
                "3365713"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=188445&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "EXTERNAL",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=188445-2020S",
        "language": {
            "de": "bei Bedarf in Englisch",
            "en": "if required in English"
        }
    },
    {
        "courseNumber": "188446",
        "semesterCode": "2020S",
        "courseType": "SE",
        "title": {
            "de": "Forschungsseminar",
            "en": "Research Seminar"
        },
        "objective": {
            "de": "<p>- Neueste Forschungsergebnisse verstehen, anwenden und auf ihre Anwendbarkeit prüfen.<br>- Weiterentwicklung von Forschungsergebnissen.<br><br></p>",
            "en": "<p>During this seminar current state-of-the-art research results are presented and their applicability and sustainability are scrutinized.</p>"
        },
        "teachingContent": {
            "de": "<p>Präsentation neuester Forschungsarbeiten auf dem Gebiet des Data Engineering, Information &amp; Knowledge Engineering, Process Engineering, Software Engineering, Web Engineering und Model Engineering.</p> \n<p><a href=\"https://www.big.tuwien.ac.at/teaching/phd-seminars/\" rel=\"nofollow\">Aktuelle Vorträge und Termine</a></p>",
            "en": "<p>Presentation of challenging topics in the fields of Data Engineering, Information &amp; Knowledge Engineering, Process Engineering, Software Engineering, Web Engineering, and Model Engineering.</p> \n<p><a href=\"https://www.big.tuwien.ac.at/teaching/phd-seminars/\" rel=\"nofollow\">List of current presentations, times, and venues</a></p>"
        },
        "additionalInformation": {
            "de": "<p>Beachten Sie beim Verfassen der Ausarbeitung bitte die Richtlinie der TU Wien zum Umgang mit Plagiaten: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf</a></p>",
            "en": "<p>Please consider the plagiarism guidelines of TU Wien when writing your seminar paper: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf</a></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Beurteilung der Präsentation, Diskussionsbeiträge</p>",
            "en": "<p>Assessment of the presentation, contributions to discussions</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1329125",
                "3365713"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=188446&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "NONE",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=188446-2020S",
        "language": {
            "de": "bei Bedarf in Englisch",
            "en": "if required in English"
        }
    },
    {
        "courseNumber": "188512",
        "semesterCode": "2020S",
        "courseType": "SE",
        "title": {
            "de": "Literaturseminar für DissertantInnen",
            "en": "Literature Seminar for PhD Students"
        },
        "objective": {
            "de": "<p>Beherrschung der Recherche und Aufarbeitung der Literatur für wissenschaftliches Arbeiten.</p>",
            "en": "<p>Gaining experience in searching and analysing literature related to own research work.</p>"
        },
        "teachingContent": {
            "de": "<p>- Literaturrecherche<br>- Kritische Würdigung der gefundenen Literatur<br>- Präsentation neuester Forschungsergebnisse</p>",
            "en": "<p>- Searching and analysing literature<br>- Presentation of newest research results</p>"
        },
        "additionalInformation": {
            "de": "<p>Beachten Sie beim Verfassen der Ausarbeitung bitte die Richtlinie der TU Wien zum Umgang mit Plagiaten: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf</a></p>",
            "en": "<p>Please consider the plagiarism guidelines of TU Wien when writing your seminar paper: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf</a></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Schreiben eines wissenschaftlichen Artikels und Halten eines Vortrages.</p>",
            "en": "<p>Writing a scientific article and giving a talk.</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1329125",
                "3365713"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=188512&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "NONE",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=188512-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "188926",
        "semesterCode": "2020S",
        "courseType": "PR",
        "title": {
            "de": "Bachelorarbeit für Informatik und Wirtschaftsinformatik",
            "en": "Bachelor Thesis for Informatics and Business Informatics"
        },
        "objective": {
            "de": "<p>Ziel dieser Lehrveranstaltung ist die selbständige Erarbeitung der Bachelorarbeit zu einem der verschiedenen Themen der Wirtschaftsinformatik oder Informatik.</p>",
            "en": "<p>The goal of this course is to write the Bachelor Thesis on one of the multiple topics of business informatics or informatics.</p>"
        },
        "teachingContent": {
            "de": "<p>Im Rahmen der Lehrveranstaltung erarbeiten Sie selbständig Ihre Bachelorarbeit zu einem bestimmten Themenbereich. Dabei beginnen Sie mit der Auswahl eines konkreten Themas aus der Liste der verfügbaren Themen zusammen mit Ihrer Betreuung. Anschließend recherchieren Sie selbständig nach relevanten Publikationen und verfassen Ihre Arbeit. Im Rahmen einer Endpräsentation stellen Sie Ihre Arbeit vor dem Auditorium bestehend aus anderen Studierenden und MitarbeiterInnen der Business Informatics Group vor.</p> \n<p>Bitte beachten Sie die <a href=\"http://www.big.tuwien.ac.at/teaching/info.html?locale=en\" rel=\"nofollow\">Formatvorlagen und Richtlinien der Business Informatics Group</a>.</p> \n<p><a href=\"http://www.big.tuwien.ac.at/teaching/practicals.html?locale=en\" rel=\"nofollow\">Aktuelle Themen der Business Informatics Group</a></p>",
            "en": "<p>During the course students will elaborate a scientific paper for a well defined topic. Students will choose a topic from one of the available topics together with the course advisor. Subsequently students will conduct literature search and finalize their assignment. In a final presentation the achieved results will be presented to the other students participating in the course.</p> \n<p>Please consider the <a href=\"http://www.big.tuwien.ac.at/teaching/info.html?locale=en\" rel=\"nofollow\">terms of reference of the Business Informatics Group</a>.</p> \n<p><a href=\"http://www.big.tuwien.ac.at/teaching/practicals.html?locale=en\" rel=\"nofollow\">Current topics of the Business Informatics Group</a></p>"
        },
        "additionalInformation": {
            "de": "<p>Aufwand für Studierende:</p> \n<pre>  4 h Vorbesprechung<br> 40 h Einlesen in relevante Literatur<br> 30 h Pflichtenheft<br> 50 h Analyse und Entwurf<br> 60 h Implementierung<br> 40 h Schreiben der Bachelorarbeit<br> 10 h Vorbereitung der Präsentation<br>  4 h Präsentation<br> 12 h Laufende Besprechungen</pre> \n<pre>----------------------------------------------</pre> \n<pre>250 h = 10 ECTS</pre>",
            "en": "<p>Effort for the student:</p> \n<pre>  4 h Preliminary Talk<br> 40 h Reading/Learning from relevant Literature<br> 30 h Requirements Engineering<br> 50 h Analysis and Design<br> 60 h Implementation<br> 40 h Writing Bachelor Thesis<br> 10 h Preparing Presentation<br>  4 h Presentation<br> 12 h Regular Meetings<br>-----------------------------------------------</pre> \n<pre>250 h = 10 ECTS</pre>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Beurteilung der erstellten Bachelorarbeit.</p>",
            "en": "<p>Assessment of the Bachelor thesis.</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "5.0",
        "lecturers": {
            "oid": [
                "1329125",
                "3365713"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=188926&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=188926-2020S",
        "language": {
            "de": "bei Bedarf in Englisch",
            "en": "if required in English"
        }
    },
    {
        "courseNumber": "188951",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Web Engineering",
            "en": "Web Engineering"
        },
        "objective": {
            "de": "<p><strong>Diese Lehrveranstaltung findet im Sommersemester 2019 NICHT statt!</strong></p> \n<p>Nach erfolgreicher Absolvierung der Lehrveranstaltung sind die Studierenden mit Technologien und Entwicklungskonzepten zur Realisierung dynamischer Web-Anwendungen unter Berücksichtigung geltender Standards (u.a. Barrierefreiheit) vertraut.</p>",
            "en": "<p><strong>This lecture has to be cancled for the summer term 2019!</strong></p> \n<p>After a successful completion of this course students will have a profound understanding of the technological foundations of web applications. In particular the course will focus on client- and server-side technologies for web-applications, modeling languages, methods for web applications, web accessibility etc.</p>"
        },
        "teachingContent": {
            "de": "<ul> \n <li>Vorbesprechung</li> \n <li>Internet und Web Überblick</li> \n <li>HTML</li> \n <li>CSS</li> \n <li>JavaScript</li> \n <li>Web Services Interaction</li> \n <li>Web Server</li> \n <li>Backend</li> \n <li>Frontend</li> \n <li>Gastvortrag</li> \n</ul>",
            "en": "<ul> \n <li><span>Preliminary discussion</span></li> \n <li><span>Overview</span></li> \n <li><span>HTML</span></li> \n <li><span>CSS</span></li> \n <li><span>JavaScript</span></li> \n <li><span>Web Services Interaction</span></li> \n <li><span>Web Server</span></li> \n <li><span>Backend</span></li> \n <li><span>Frontend</span></li> \n <li><span>Guest Lecture</span></li> \n</ul>"
        },
        "additionalInformation": {
            "de": "<p><span>Allgemeine Anfragen richten Sie bitte an&nbsp;<a href=\"mailto:web-engineering@big.tuwien.ac.at\" rel=\"nofollow\">web-engineering@big.tuwien.ac.at</a></span></p> \n<p><span>Der Aufwand für Studierende beträgt 3 ECTS oder 75 Stunden, aufgeteilt in:</span></p> \n<p><span>13,5 Stunden Vorlesung (9 x 1,5 Stunden)</span><span><br></span><span> &nbsp; 44 Stunden Übungen (4 x 11 Stunden) </span><span><br></span><span> &nbsp; &nbsp; 1 Stunde Abgabgespräche (2 x 30 min)</span><span><br></span><span>&nbsp; 15 Stunden Testvorbereitung (2 x 7,5 Stunden)</span><span><br></span><span>&nbsp; &nbsp; 1 Stunde Tests (2 x 30 min)</span></p>",
            "en": "<p><span>If you have any questions, please contact&nbsp;<a href=\"mailto:web-engineering@big.tuwien.ac.at\" rel=\"nofollow\">web-engineering@big.tuwien.ac.at</a></span></p> \n<p><span>Student effort is 3 ECTS or 75 hours, broken down as:</span></p> \n<p><span><span>13,5 h Lecture (9 x 1,5 h)</span><span><br></span><span> &nbsp; 44 h Assignments (4 x 11 h)</span><span><br></span><span> &nbsp; &nbsp; 1 h Assignment Reviews (2 x 30 min)</span><span><br></span><span> &nbsp; 15 h Preparing for tests (2 x 7,5 h)</span><span><br></span><span> &nbsp; &nbsp; 1 h Tests (2 x 30 min)</span></span></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<ul> \n <li><span><span>Die Übungen werden mit Hilfe von automatisierten Tests beurteilt.</span></span></li> \n <li><span><span>Abgabegespräche dienen hauptsächlich der Beantwortung von Fragen.</span></span></li> \n <li><span><span>Das Ausmaß der individuellen Teilnahme an den Gruppenübungen wird kontrolliert und kann zur Note beitragen.</span></span></li> \n <li>Zwei schriftliche Tests über den Vorlesungsinhalt werden wie üblich abgehalten.</li> \n</ul>",
            "en": "<ul> \n <li><span><span>The assignments are graded through automated tests.</span></span></li> \n <li><span><span>Assignment reviews have the main purpose of resolving questions.</span></span></li> \n <li><span>The amount of individual participation in group assignments will be checked and may contribute to the grade.</span></li> \n <li><span>Two written tests about the lecture contents are administered in the usual way.</span></li> \n</ul>"
        },
        "related": {
            "recommendation": {
                "de": "<p>Unterliegt der STEOP-Regelung.</p> \n<p>Grundkenntnisse von Versionskontrollsystemen wird vorausgesetzt, insbesondere der Umgang mit&nbsp;<a href=\"https://git-scm.com\" rel=\"nofollow\">git</a>.</p>",
                "en": "<p>Participation&nbsp;in this course is regulated by STEOP.</p> \n<p>Basic knowledge of version control systems is required, particularly how to use&nbsp;<a href=\"https://git-scm.com\" rel=\"nofollow\">git</a>.</p>"
            },
            "accompanyingCourses": {
                "course": "184705"
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "6447109",
                "1329125",
                "7360709"
            ]
        },
        "tutors": {
            "oid": [
                "14865273",
                "17784393",
                "12627209",
                "11082193",
                "17784353"
            ]
        },
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://web-engineering.big.tuwien.ac.at",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=188951-2020S",
        "language": {
            "de": "Englisch",
            "en": "English"
        }
    },
    {
        "courseNumber": "188976",
        "semesterCode": "2020S",
        "courseType": "PV",
        "title": {
            "de": "Privatissimum für DissertantInnen",
            "en": "Exclusive Tutorial for PhD Students"
        },
        "objective": {
            "de": "<p>Erarbeitung von individuell auf das Dissertationsthema abgestimmten Methoden und Verfahren</p>",
            "en": "<p>Development of methods and techniques tailored to the individual PhD topic.</p>"
        },
        "teachingContent": {
            "de": "<p>Im Privatissimum werden DissertantInnen einzeln betreut. Individuell zu den jeweiligen Dissertationsthemen werden wissenschaftliche Methoden erarbeitet.</p>",
            "en": "<p>In the exclusive tutorial PhD students are supervised individually. According to the individual PhD topic scientific approaches and methods are developed.</p>"
        },
        "additionalInformation": {
            "de": null,
            "en": null
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Beurteilung der Präsentation, Diskussionsbeiträge</p>",
            "en": "<p>Assessment of the presentation, contributions to discussions</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1329125",
                "3365713",
                "1026725"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=188976&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "EXTERNAL",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=188976-2020S",
        "language": {
            "de": "bei Bedarf in Englisch",
            "en": "if required in English"
        }
    },
    {
        "courseNumber": "188978",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "IT Governance",
            "en": "IT Governance"
        },
        "objective": {
            "de": "<p>The aim of this course is to provide a detailed understanding on the subject of IT Governance.</p>",
            "en": "<p>The aim of this course is to provide a detailed understanding on the subject of IT Governance.</p>"
        },
        "teachingContent": {
            "de": "<ul> \n <li>IT Governance</li> \n <li>IT Strategy</li> \n</ul> \n<ul> \n <li>Tasks of an IT department</li> \n <li>Functions of an IT department</li> \n <li>What do I have to do by myself?</li> \n <li>Forms of organizations in IT</li> \n <li>IT governance processes (incl. COBIT, ITIL, and CMMI)</li> \n</ul> \n<ul> \n <li>Managing an IT department</li> \n <li>IT development</li> \n <li>Portfolio Management</li> \n <li>IT controlling / IT reporting</li> \n <li>Compliance in IT</li> \n</ul> \n<ul> \n <li>IT Sourcing</li> \n <li>Architecture</li> \n <li>Data Governance</li> \n <li>Cloud-based Solutions</li> \n <li>Internet of Things &amp; Industrie 4.0</li> \n <li>Data &amp; Analytics</li> \n <li>SAP-based Solutions</li> \n <li>Information Securtiy</li> \n <li>Sector-specific trends (Banking, Energy, Production)</li> \n</ul>",
            "en": "<ul> \n <li>IT Governance</li> \n <li>IT Strategy</li> \n</ul> \n<ul> \n <li>Tasks of an IT department</li> \n <li>Functions of an IT department</li> \n <li>What do I have to do by myself?</li> \n <li>Forms of organizations in IT</li> \n <li>IT governance processes (incl. COBIT, ITIL, and CMMI)</li> \n</ul> \n<ul> \n <li>Managing an IT department</li> \n <li>IT development</li> \n <li>Portfolio Management</li> \n <li>IT controlling / IT reporting</li> \n <li>Compliance in IT</li> \n</ul> \n<ul> \n <li>IT Sourcing</li> \n <li>Architecture</li> \n <li>Data Governance</li> \n <li>Cloud-based Solutions</li> \n <li>Internet of Things &amp; Industrie 4.0</li> \n <li>Data &amp; Analytics</li> \n <li>SAP-based Solutions</li> \n <li>Information Securtiy</li> \n <li>Sector-specific trends (Banking, Energy, Production)</li> \n</ul>"
        },
        "additionalInformation": {
            "de": null,
            "en": null
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Der Leistungsnachweis wird durch die ausgearbeitete Fallstudie, die darüber verfasste Sminararbeit und deren Präsentation erbracht.</p>",
            "en": "<p>Proof of performance is provided by the case study, the ministry paper written on it and its presentation.</p>"
        },
        "related": {
            "recommendation": {
                "de": "<p>Der vorhergehende Besuch der Lehrveranstaltung Enterprise Architecture im Windersemester wird empfohlen, ist aber keine verpflichtende Voraussetzung.</p>",
                "en": "<p>Previous attendance of the course Enterprise Architecture in the wind semester is recommended but not mandatory.</p>"
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1329125",
                "3365713"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=188978&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=188978-2020S",
        "language": {
            "de": "Englisch",
            "en": "English"
        }
    },
    {
        "courseNumber": "194074",
        "semesterCode": "2020S",
        "courseType": "PR",
        "title": {
            "de": "Project in Computer Science 1",
            "en": "Project in Computer Science 1"
        },
        "objective": {
            "de": null,
            "en": null
        },
        "teachingContent": {
            "de": "<p>Im Rahmen der Lehrveranstaltung setzen Sie eine konkrete Aufgabenstellung beginnend von der groben Anforderungsbeschreibung bis hin zur prototypischen Realisierung um. Der konkrete Umfang Ihres Projekts wird gemeinsam mit der LVA-Leitung festgelegt und hängt vom gewählten Thema, der Themenkomplexität und der Gruppengröße ab.</p> \n<p>Bitte beachten Sie die Einhaltung der&nbsp;<a href=\"http://www.big.tuwien.ac.at/teaching/info.html?locale=en\" rel=\"nofollow\">Formatvorlagen und Richtlinien der Business Informatics Group.</a></p> \n<p><a href=\"http://www.big.tuwien.ac.at/teaching/practicals.html?locale=en\" rel=\"nofollow\">Aktuelle Themen der Business Informatics Group</a></p>",
            "en": "<p>During the course of this project students will realize a practical assignment beginning with a coarse-grained requirements definition culminating in a final prototypical realization. The exact definition of your project assignment will be done together with your advisor and depends on the chosen topic, the topic's complexity, and the size of your team (if you are working in one).</p> \n<p>Please consider the&nbsp;<a href=\"http://www.big.tuwien.ac.at/teaching/info.html?locale=en\" rel=\"nofollow\">terms of reference of the Business Informatics Group.</a></p> \n<p><a href=\"http://www.big.tuwien.ac.at/teaching/practicals.html?locale=en\" rel=\"nofollow\">Current lab assignment topics of the Business Informatics Group</a></p>"
        },
        "additionalInformation": {
            "de": null,
            "en": null
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Studierende werden aufgrund der Qualität der praktischen Implementierung und deren Dokumentation beurteilt</p>",
            "en": "<p>Students are graded based on the quality of the implementation of the prototype system and its documentation.</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "4.0",
        "lecturers": {
            "oid": [
                "3365713",
                "1329125"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=194074&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "NONE",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=194074-2020S",
        "language": {
            "de": "bei Bedarf in Englisch",
            "en": "if required in English"
        }
    },
    {
        "courseNumber": "194075",
        "semesterCode": "2020S",
        "courseType": "PR",
        "title": {
            "de": "Project in Computer Science 2",
            "en": "Project in Computer Science 2"
        },
        "objective": {
            "de": null,
            "en": null
        },
        "teachingContent": {
            "de": "<p>Im Rahmen der Lehrveranstaltung setzen Sie eine konkrete Aufgabenstellung beginnend von der groben Anforderungsbeschreibung bis hin zur prototypischen Realisierung um. Der konkrete Umfang Ihres Projekts wird gemeinsam mit der LVA-Leitung festgelegt und hängt vom gewählten Thema, der Themenkomplexität und der Gruppengröße ab.</p> \n<p>Bitte beachten Sie die Einhaltung der&nbsp;<a href=\"http://www.big.tuwien.ac.at/teaching/info.html?locale=en\" rel=\"nofollow\">Formatvorlagen und Richtlinien der Business Informatics Group.</a></p> \n<p><a href=\"http://www.big.tuwien.ac.at/teaching/practicals.html?locale=en\" rel=\"nofollow\">Aktuelle Themen der Business Informatics Group</a></p>",
            "en": "<p>During the course of this project students will realize a practical assignment beginning with a coarse-grained requirements definition culminating in a final prototypical realization. The exact definition of your project assignment will be done together with your advisor and depends on the chosen topic, the topic's complexity, and the size of your team (if you are working in one).</p> \n<p>Please consider the&nbsp;<a href=\"http://www.big.tuwien.ac.at/teaching/info.html?locale=en\" rel=\"nofollow\">terms of reference of the Business Informatics Group.</a></p> \n<p><a href=\"http://www.big.tuwien.ac.at/teaching/practicals.html?locale=en\" rel=\"nofollow\">Current lab assignment topics of the Business Informatics Group</a></p>"
        },
        "additionalInformation": {
            "de": null,
            "en": null
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Studierende werden aufgrund der Qualität der praktischen Implementierung und deren Dokumentation beurteilt</p>",
            "en": "<p>Students are graded based on the quality of the implementation of the prototype system and its documentation.</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "4.0",
        "lecturers": {
            "oid": [
                "3365713",
                "1329125"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=194075&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "NONE",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=194075-2020S",
        "language": {
            "de": "bei Bedarf in Englisch",
            "en": "if required in English"
        }
    },
    {
        "courseNumber": "183109",
        "semesterCode": "2020S",
        "courseType": "SE",
        "title": {
            "de": "Forschungsseminar für DissertantInnen",
            "en": "Research seminar for PhDs"
        },
        "objective": {
            "de": "<p>Präsentation wissenschaftlicher Forschungsergebnisse</p>",
            "en": "<p>Presentation of scientific research results</p>"
        },
        "teachingContent": {
            "de": "<ul> \n <li><span>Erarbeitung relevanter wissenschaftlicher Literatur aus dem gewählten Dissertationsbereich und Präsentation</span></li> \n <li><span>Diskussion der Aufgabenstellung und von wissenschaflichen Aspekten des Themenkreises der Dissertation.</span></li> \n <li><span>Identifikation und Diskussion von Problemstellungen und Lösungsstrategien während der Arbeit an der Dissertation.</span></li> \n <li><span>Weiterer Schwerpunkt:&nbsp;</span><span>Publizieren in den (technischen) Wissenschaften</span></li> \n</ul>",
            "en": "<ul> \n <li><span>Analyses of relevant scientific literature from the selected dissertation area and presentation of findings</span></li> \n <li><span>Discussion of the task and scientific aspects of the topic of the dissertation.</span></li> \n <li><span>Identification and discussion of problems and solution strategies while working on the dissertation.</span></li> \n <li><span>Further focus: Publishing in the (technical) sciences.</span></li> \n</ul>"
        },
        "additionalInformation": {
            "de": "<p><span>Allgemeine Anfragen richten Sie bitte an&nbsp;</span><a href=\"mailto:care4u@inso.tuwien.ac.at\" rel=\"nofollow\">care4u@inso.tuwien.ac.at</a><span>.</span></p> \n<p>Beachten Sie beim Verfassen der Ausarbeitung bitte die Richtlinie der TU Wien zum Umgang mit Plagiaten: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf</a></p>",
            "en": "<p><span>If you have any questions, please contact </span><a href=\"mailto:care4@inso.tuwien.ac.at\" rel=\"nofollow\">care4u@inso.tuwien.ac.at</a><span>.</span></p> \n<p>Please consider the plagiarism guidelines of TU Wien when writing your seminar paper: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf</a></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Bewertet wird die Qualität der Präsentation.</p>",
            "en": "<p>The quality of the presentation is evaluated.</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": "1709493"
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=183109&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "NONE",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=183109-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "183131",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Risikomanagement",
            "en": "Risk Management"
        },
        "objective": {
            "de": "<p>Im Rahmen der Lehrveranstaltung Risikomanagement werden Ihnen praxiserprobte Techniken und Methoden zur Identifikation, Analyse, Vermeidung und Kontrolle von Projektrisiken vermittelt. Das theoretische Basiswissen wird mit besonderer Berücksichtigung der Anforderungen und Eigenschaften von IT-Projekten vermittelt. Zusätzlich werden durch Fallbeispiele und Übungsaufgaben praxisorientierte Elemente in die Lehrveranstaltung einfließen. <strong></strong></p> \n<p><strong>Didaktisches Vorgehen:</strong> <br>Die Lehrveranstaltung gliedert sich in einen Vorlesungs- und einen Übungsteil. In der Vorlesung werden Grundlagen sowie unterschiedliche Methoden und Techniken im Risikomanagement vorgestellt. Die vorgestellten Methoden und Techniken sollen im Übungsteil mit praxisnahen Beispielen eingesetzt werden. Im Rahmen der Übung gilt es Aufgaben in Kleingruppen auszuarbeiten. Das ausgearbeiteten Übungsbeispiele werden für jede Gruppe einzeln bewertet und zusätzlich am Ende des Semesters in Form einer Abschlusspräsentation präsentiert. Bei der Abschlusspräsentation gilt Anwesenheitspflicht für die gesamte Gruppe. Am Ende des Semesters findet ein schriftlicher Abschlusstest statt. Zur Ermittlung der Abschlussnote werden die Übungspunkte und das Ergebnis des schriftlichen Tests addiert. Aus der Punktesumme (Maximum 100) wird die Abschlussnote ermittelt.</p>",
            "en": "<p>After finishing this lecture you will be familiar with fundamental methodologies and techniques of project management. In addition you should know about soft skills and project management tools which are essential for a successful project manager. For a better understanding of the theoretical content, some practice-oriented case studies will be discussed in the lecture.</p>"
        },
        "teachingContent": {
            "de": "<p>Folgende Themenschwerpunkte bilden dabei den Inhalt der Lehrveranstaltung:</p> \n<ul> \n <li>Grundlagen und Definitionen</li> \n <li>Eigenschaften und Klassifikation von Risiken</li> \n <li>Methoden und Techniken im Risikomanagement</li> \n <li>Risikomanagement als kontinuierlicher Prozess in Projekten</li> \n <li>Risikomanagement-Strategien</li> \n <li>Krisenmanagement</li> \n <li>Besondere Aspekte des Risikomanagement</li> \n <li>Spezialthemen</li> \n <li>Fallstudien</li> \n</ul>",
            "en": "<p>The lecture will cover the following aspects of project management:</p> \n<ul> \n <li>Definitions, methods and approaches</li> \n <li>Characteristics and classification of a project</li> \n <li>Types of project organisation</li> \n <li>Phases of a project, including planning and controlling</li> \n <li>Quality and risk management in projects</li> \n <li>Formation of Teams and the role of team members</li> \n <li>Estimation of efforts and costs</li> \n <li>Communication and documentation in projects</li> \n <li>Project management tools - Special topics</li> \n <li>Case studies</li> \n</ul>"
        },
        "additionalInformation": {
            "de": "<p>Bei Fragen wenden Sie sich bitte an <a href=\"mailto:%20care4u@inso.tuwien.ac.at\" rel=\"nofollow\">care4u@inso.tuwien.ac.at</a>.</p> \n<p><strong>Stundenaufteilung:</strong></p> \n<p>Vorbesprechung und Blockeinheiten (22 Stunden)<br> Ausarbeitung (2 x 13 Stunden)<br> Vorbereitung Abschlusspräsentation (10 Stunden)<br> Abschlusspräsentation (6 Stunden)<br>Vorbereitung Prüfung (10 Stunden)<br> Prüfung (1 Stunde)<br><br> <strong>GESAMT 3 ECTS (75 Stunden)</strong></p> \n<p><strong>Literaturempfehlungen:<br><br></strong><span>DeMarco, Tom/Lister, Thimothy: Bärentango: Mit Risikomanagement Projekte zum Erfolg führen. Hanser, 2003. ISBN 3-446-22333-9.<br></span>Brandstäter<span>, Jonathan:&nbsp;Agile IT-Projekte erfolgreich gestalten.Risikomanagement als Ergänzung zu Scrum.&nbsp;Springer Vieweg, 2013. ISBN&nbsp;978-3-658-04429-9.<br></span>Romeike, Frank: Risikomanagement.&nbsp;Gabler Verlag, 2018.&nbsp;ISBN 978-3-658-13952-0.</p> \n<p>&nbsp;</p>",
            "en": "<p><strong>Breakdown:</strong></p> \n<p>Lectures&nbsp; (22 Hours)<br> Homework (2 x 13 Hours)<br> Preparation Final Presentation (10 Hours)<br> Final Presentation (6 Hours)<br> Preparation Exam (10 Hours)<br> Exam (1 Hour)<br><br> <strong>TOTAL 3 ECTS (75 Hours)</strong></p> \n<p><strong>Recommended literature:</strong></p> \n<p>DeMarco, Tom/Lister, Thimothy: Bärentango: Mit Risikomanagement Projekte zum Erfolg führen. Hanser, 2003. ISBN 3-446-22333-9.<br>Brandstäter, Jonathan:&nbsp;Agile IT-Projekte erfolgreich gestalten.Risikomanagement als Ergänzung zu Scrum.&nbsp;Springer Vieweg, 2013. ISBN&nbsp;978-3-658-04429-9.<br>Romeike, Frank: Risikomanagement.&nbsp;Gabler Verlag, 2018.&nbsp;ISBN 978-3-658-13952-0.</p> \n<p>&nbsp;</p>"
        },
        "lectureNotes": {
            "de": "DeMarco, Tom/Lister, Thimothy: Bärentango : Mit Risikomanagement Projekte zum Erfolg führen, München u. a. : Hanser, 2003 ISBN 3-446-22333-9",
            "en": "DeMarco, Tom/Lister, Thimothy: Bärentango : Mit Risikomanagement Projekte zum Erfolg führen, München u. a. : Hanser, 2003 ISBN 3-446-22333-9"
        },
        "examinationModalities": {
            "de": "<p>Bewertung der Ausarbeitung mit Abschlusspräsentation. Schriftliche Prüfung am Semesterende. Das ausgearbeiteten Übungsbeispiele werden für jede Gruppe einzeln bewertet und zusätzlich am Ende des Semesters in Form einer Abschlusspräsentation präsentiert. Bei der Abschlusspräsentation gilt Anwesenheitspflicht für die gesamte Gruppe. Zur Ermittlung der Abschlussnote werden die Übungspunkte (Ausarbeitung und Präsentation) und das Ergebnis der schriftlichen Prüfung addiert. Aus der Punktesumme (Maximum 100) wird die Abschlussnote ermittelt.&nbsp;</p> \n<p>Während der LVA besteht Anwesenheitspflicht.</p>",
            "en": "<p>Evaluation of the papers with final presentation and written examination at the end of the semester. To determine the final grade, the exercise points and the result of the written test are added together. The final grade is determined from the total points (maximum 100).</p> \n<p>Attendance is compulsory during the LVA.</p>"
        },
        "related": {
            "recommendation": {
                "de": "<p>Es werden keine Vorkenntnisse vorausgesetzt, da in der Vorlesung alle Grundlagen vermittelt werden.</p>",
                "en": "<p>No fundamental knowledge is requirded to attend this course.</p>"
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1709493",
                "2510317"
            ]
        },
        "tutors": {
            "oid": "15699721"
        },
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=183131&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=183131-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "183223",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Web Application Engineering & Content Management",
            "en": "Web Application Engineering & Content Management"
        },
        "objective": {
            "de": "<p>Ziel der Lehrveranstaltung ist die Vermittlung von Web Application Engineering als<br>Querschnittsmaterie mehrerer Technologien und Informatikdisziplinen (Software Engineering, Security,&nbsp;Usability Engineering, DevOps, Ausfallsicherheit &amp; Monitoring im Betrieb, ...).</p>",
            "en": "<p>Web Application Engineering is presented as an interdisciplinary subject with the use of a variety of tools and methods. The main part of the course are multiple practical tasks which will be completed in groups.</p>"
        },
        "teachingContent": {
            "de": "<p>Fortgeschrittene Aspekte der Web Entwicklung werden anhand von praktischen Beispielen erarbeitet.</p> \n<p>Besonderer Fokus liegt dabei auf folgenden Inhalten:</p> \n<ul> \n <li>Entwicklung von Web-Anwendungen (Backend und Frontend)</li> \n <li>Einsatz von Frontend JavaScript-Frameworks</li> \n <li>Verwendung der HTML5 Browser-API</li> \n <li>Integration von Single Sign-On Protokollen</li> \n <li>Deployment mittels Container (Docker)</li> \n</ul> \n<p><strong>Ablauf</strong>:&nbsp;In den Übungen wird eine Gruppe von Aufgabenstellungen im Team so&nbsp;<br>gelöst, dass die Absolventen Erfahrungen mit einschlägigen Werkzeugen&nbsp;<br>machen können.</p> \n<p><strong>Didaktisches Vorgehen:</strong> <br>Die zuständige&nbsp;Forschungsgruppe vermittelt ingenieurwissenschaftliche Sichtweisen.&nbsp;<br>Didaktisch bedeutet dies für die vorliegende LVA: Vermittlung der&nbsp;<br>erforderlichen Fachgrundlagen, Anleitung zur situativer Recherche bei&nbsp;<br>Vertiefungsbedarf, Vorstellung von realen, oft großen Fallbeispielen,&nbsp;<br>Erprobung und Erfahrung in für die LVA angemessenen Konzeptbildungen,&nbsp;<br>Übungen, Teilprojekten und Anwendungen.</p>",
            "en": "<p>The course will discuss multiple topics, including:</p> \n<ul> \n <li>Development of web applications (backend and frontend)</li> \n <li>Use of frontend JavaScript frameworks</li> \n <li>Integration of the HTML5 browser API</li> \n <li>Integration of single sign-on protocols</li> \n <li>Containter deployment (Docker)</li> \n</ul>"
        },
        "additionalInformation": {
            "de": "<p>Bei Fragen bitte an<a href=\"mailto:waecm@inso.tuwien.ac.at\" rel=\"nofollow\"> waecm@inso.tuwien.ac.at</a>&nbsp;wenden.</p> \n<p><strong>Aufwandsschätzung&nbsp;(ECTS-Breakdown):</strong></p> \n<ul> \n <li>Vorlesungen: 15 h</li> \n <li>Prüfungsvorbereitungen: 10 h</li> \n <li>Gruppenbeispiele: 48 h</li> \n <li>Prüfung: 2&nbsp;</li> \n</ul> \n<p><strong>Summe: 75 Stunden (3 ECTS)</strong></p>",
            "en": "<p>If you have any questions, please contact <a href=\"mailto:waecm@inso.tuwien.ac.at\" rel=\"nofollow\">&nbsp;waecm@inso.tuwien.ac.at</a>.</p> \n<p><strong>Effort for the student (ECTS-Breakdown):</strong></p> \n<ul> \n <li>Lectures: 15 h</li> \n <li>learning for exam: 10 h</li> \n <li>Practical assignments: 48 h</li> \n <li>Exam: 2h</li> \n</ul> \n<p><strong>Total: 75 hours (3 ECTS)</strong></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Erstellung einer Web-Applikation, die Umsetzung gliedert sich in mehrere Teilaufgaben. Die Lösung wird in den Abgabegesprächen gemeinsam mit der Gruppe diskutiert und anschließend benotet. Am Ende des Semesters findet ein abschließender Test über den Inhalt der Vorlesung statt.</p>",
            "en": "<p>Creation of a web application, the implementation is divided into several subtasks. The solution is discussed with the group in the delivery discussions and then graded. At the end of the semester there is a final test on the content of the lecture.</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1709493",
                "2271569"
            ]
        },
        "tutors": {
            "oid": [
                "14777421",
                "22369281"
            ]
        },
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=183223&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=183223-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "183231",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "ERP Systeme",
            "en": "ERP Systems"
        },
        "objective": {
            "de": "<p>Die Vermittlung allgemeiner Grundlagen betrieblicher Informationssysteme, eine Einführung in ERP Systeme (Enterprise Resource Planing) und die eingehende Auseinandersetzung mit Prozessmodellierung und -management bilden den Schwerpunkt dieser Lehrveranstaltung. Neben der theoretischen Wissensvermittlung beschäftigt sich der Übungsteil mit operationalen Aspekten der Einführung von ERP Systemen und deren Auswirkung auf die IT und das Unternehmen.</p>",
            "en": "<p>The goal of this course is tomake participants familiar with business information systems, especially by introducing enterprise resource planning systems. A deeper dive into process modeling and process management is another focal topic. Besides theory, ERP systems operations and the derivations for the IT management of a company become inherent to the course.</p>"
        },
        "teachingContent": {
            "de": "<p>Folgende Themenschwerpunkte bilden den Inhalt der Lehrveranstaltung:<br>• Einführung ERP-Systeme (Applikationen, Funktion)<br>• Einsatzgebiete und Nutzen<br>• Einführung Workflows Prozessmodellierung und -management<br>• Wartung von ERP Systemen<br>• Prozessanalyse<br>• Trends in ERP Systemen (inkl. wichtiger Hersteller)<br>• Grundlagen Systemanalyse, Plattformwahl, Einsatzplanung, Systemimplementierung, Systemintegration, Roll-Out, Schulung, Support, Fallbeispiele</p>",
            "en": "<p>The following main topics form the content of the course:<br>- Introduction to ERP systems (applications, function)<br>- Fields of application and benefits<br>- Introduction of workflows process modelling and management<br>- Maintenance of ERP systems<br>- Process analysis<br>- Trends in ERP systems (incl. major manufacturers)<br>- Basics system analysis, platform selection, resource planning, system implementation, system integration, roll-out, training, support, case studies</p>"
        },
        "additionalInformation": {
            "de": "<p>Die Vorlesung ist eine Pflichtvorlesung für Bachelor WInf, Modul Information System Management.</p> \n<p><strong><strong>Aufwandsschätzung</strong>&nbsp;(<strong>ECTS-Breakdown</strong>):</strong><br><br>Vorlesungseinheiten: 19,5 Stunden<br>Vorbereitung auf Wiederholungsfragen: 12 Stunden<br>Prüfung und Vorbereitung: 5 Stunden<br>Team Kickoff mit Tutor: 0,5 Stunden<br>Vorbereitung und Präsentation: 8 Stunden<br>3 Gruppenarbeiten mit Vorbereitung à 10 Stunden: 30 Stunden</p> \n<p><strong>Summe 75 Stunden (3 ECTS)</strong></p>",
            "en": "<p>The course is mandatory for \"Bachelor Wirtschaftinformatik\" module \"Information System Management\"<strong><br></strong></p> \n<p><strong>Effort for the student (<strong>ECTS-Breakdown</strong>):</strong><br><br>Lectures: 19,5 h<br>Further self-studies: 12 h<br>Preparation time for the written exam: 5 Stunden<br>Team Kickoff: 0,5 h<br>Preparation of the presentation: 8 Stunden<br>3 practical assignments: 30 Stunden</p> \n<p><strong>Total: 75 hours (3 ECTS)</strong></p>"
        },
        "lectureNotes": {
            "de": "<p>[1] Slack et al. (2012), Operations and Process Management 3rd edition<br />[2] Varian (1999), Grundz&uuml;ge der Mikro&ouml;konomik, 4. Auflage, Oldenbourg<br />[3] Hansen, Neumann (2001), Wirtschaftsinformatik I : Grundlagen betrieblicher Informationsverarbeitung, 8. Auflage, Lucius &amp; Lucius<br />[4] Jenny (2001), Projektmanagement in der Wirtschaftsinformatik, 5. Auflage,vdf<br />[5]Pohl et al. (2011), Basiswissen Requirements Engineering, 3. Auflage, dpunkt<br />[6] Lv F., Chen J. (2010); Influencing Factors on ERP system selection proceedings 2010 IEEE International Conference on Software Engineering and Service Sciences (ICSESS)<br />[7] Gronau N. (2010), ERP-Auswahl mittels RoI-Analyse &ndash; Risikoreduzierung und Nutzensteigerung, in: ERP Management 6/2010, GITO Verlag<br />[8] Hiliam C., Edwards H. (2001), A case study approach to evaluation of Information Technology/Information systems (IT/IS) investment evaluation processses within SMEs, EJISE, http://www.ejise.com/volume-4/volume-4-issue1/issue-art1.htm<br />[9] Scherer, E., Return on Investment von ERP-Investitionen, online, http://<a href=\"http://www.changebox.info/\">www.changebox.info/</a>changebox/_knowledge_corner/i2s_publikationen/ng19_scherer.pdf</p>",
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Bewertung der Ausarbeitung von Übungsbeispielen in Form von Gruppenarbeiten. Schriftliche Prüfung am Semesterende.</p>",
            "en": "<p>Evaluation of the elaboration of exercises in the form of group work. Written examination at the end of the semester.</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            },
            "continuativeCourses": {
                "course": "183607"
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": "1709493"
        },
        "tutors": {
            "oid": "16282373"
        },
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "http://www.inso.tuwien.ac.at/lectures/enterprise_resource_planning/erp_systeme_vu/",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=183231-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "183243",
        "semesterCode": "2020S",
        "courseType": "PR",
        "title": {
            "de": "Advanced Software Engineering",
            "en": "Advanced Software Engineering"
        },
        "objective": {
            "de": "<p>Vertiefung der Fähigkeit zur Software-Entwicklung im Team.</p>",
            "en": "<p>Consolidation of software development abilties as part of a team.</p>"
        },
        "teachingContent": {
            "de": "<ul> \n <li>Quantifizierung der Eigenschaften von komplexen Softwaresystemen \n  <ul> \n   <li>Systemgröße und -komplexität</li> \n   <li>Verfügbarkeit, Quality of Service (QoS)</li> \n   <li>Erweiterter Softwarelebenszyklus</li> \n   <li>Anwendungskritikalität&nbsp;</li> \n  </ul> </li> \n <li>Vorgehensweisen in der Entwicklung von erweiterten Softwaresystemen \n  <ul> \n   <li>Architektonische Ansätze, wie z.B. komponentenbasierte Softwareentwicklung</li> \n   <li>Lebenszyklusmanagement und Dokumentation</li> \n   <li>Softwareentwurfsmuster</li> \n  </ul> </li> \n <li>Komponentenbasierte Entwicklung komplexer Softwaresysteme</li> \n <li>Automatisierung in der Entwicklung erweiterter Softwaresysteme \n  <ul> \n   <li>Sourcecode Management</li> \n   <li>Continuous Integration und Testen</li> \n   <li>Fortgeschrittenes Buildmanagement</li> \n   <li>Persistenztechnologien (z.B. objekt-relationales Mapping)</li> \n  </ul> </li> \n <li>Aspekte von Enterprisearchitekturen</li> \n <li>Ausgewählte Themen aus Industrie und Forschung \n  <ul> \n   <li>Softwareentwicklung für mobile Geräte</li> \n   <li>Fallbeispiel Migrationsprojekte</li> \n   <li>Ökosysteme, Tools und Frameworks zur Softwareentwicklung</li> \n  </ul> </li> \n</ul>",
            "en": "<ul> \n <li>Overview of characteristics of advanced software systems&nbsp; \n  <ul> \n   <li>System size and complexity&nbsp;</li> \n   <li>System dependability, Quality of Service (QoS)&nbsp;</li> \n   <li>Extended Software Lifecycle&nbsp;</li> \n   <li>Mission/safety criticality&nbsp;</li> \n  </ul> </li> \n <li>Software Engineering approaches for advanced software systems &nbsp; \n  <ul> \n   <li>Architecture styles, such as component-based software engineering &nbsp;</li> \n   <li>Lifecycle management and documentation&nbsp;</li> \n   <li>Software design patterns &nbsp;</li> \n  </ul> </li> \n <li>Component-based engineering of complex software systems &nbsp;</li> \n <li>Automation in developing advanced software systems ¿ Source code management &nbsp; \n  <ul> \n   <li>Continuous integration and testing&nbsp;</li> \n   <li>Advanced build management&nbsp;</li> \n   <li>Persistence techniques (e.g. object-relational mapping)&nbsp;</li> \n  </ul> </li> \n <li>Aspects of enterprise architectures&nbsp;</li> \n <li>Overview of selected research and industrial topics in ASE&nbsp; \n  <ul> \n   <li>Software engineering for mobile devices&nbsp;</li> \n   <li>Migration project case studies&nbsp;</li> \n   <li>Ecosystems for software engineering tools and frameworks</li> \n  </ul> </li> \n</ul>"
        },
        "additionalInformation": {
            "de": "<p><span><span>Allgemeine Anfragen richten Sie bitte an&nbsp;</span><a href=\"mailto:care4u@inso.tuwien.ac.at\" rel=\"nofollow\">care4u@inso.tuwien.ac.at</a><span>.</span></span></p> \n<p><span>Nähere Informationen und Aktuelles erfahren Sie ab Semesterbeginn auf der TUWEL-Lehrveranstaltungsseite.</span></p> \n<p><strong>ECTS-Breakdown (Aufwandsschätzung)</strong></p> \n<ul> \n <li><span>Vorbesprechung: 1 Stunde</span></li> \n <li><span>Vorbereitung auf den Einstiegstest: 1 Stunde</span></li> \n <li><span>Einstiegstest: 4 Stunden</span></li> \n <li><span>Kickoff-Treffen: 1 Stunde</span></li> \n <li><span>12x Treffen mit Tutor: 12 Stunden</span></li> \n <li><span>3x Management Review: 3 Stunden</span></li> \n <li><span>Vorbereitung auf Präsentationen (Management Review, ASE Day): 3 Stunden</span></li> \n <li><span>Gruppeninterne Treffen/ Meetings, Projektmanagement: 30 Stunden</span></li> \n <li><span>Ideenfindung, Projektvorschlag, Projektauftrag: 5 Stunden</span></li> \n <li><span>Einarbeitung in die Technologien: 10 Stunden</span></li> \n <li><span>Implementierung: 60 Stunden</span></li> \n <li><span>Qualitätssicherung / Testen: 18 Stunden</span></li> \n <li><span>ASE-Day: 2 Stunden</span></li> \n</ul> \n<p><strong>Summe: 150 Stunden (6 ECTS)</strong></p>",
            "en": "<p><span>If you have any questions, please contact </span><a href=\"mailto:care4@inso.tuwien.ac.at\" rel=\"nofollow\">care4u@inso.tuwien.ac.at</a><span>.</span></p> \n<p>Further information can be found in the TUWEL-Course at the beginning of the semester.</p> \n<p><strong>ECTS-Breakdown</strong></p> \n<p>&nbsp;</p> \n<ul> \n <li><span>Preliminary Discussion: 1 Hour</span></li> \n <li><span>Preparation for the Entry test: 1 Hour</span></li> \n <li><span>Entry test: 4 Hours</span></li> \n <li><span>Kickoff-Meeting: 1&nbsp;Hour</span></li> \n <li><span>12x Meeting with the Tutor: 12 Hours</span></li> \n <li><span>3x Management Review: 3 Hours</span></li> \n <li><span>Preparation for Presentations (Management Review, ASE Day): 3 Hours</span></li> \n <li><span>Internal Group Meetings, Projectmanagement: 30 Hours</span></li> \n <li><span>Finding of Ideas, Project proposal, Project contract: 5 Hours</span></li> \n <li><span>Induction to Technologies: 10 Hours</span></li> \n <li><span>Implementation: 60 Hours</span></li> \n <li><span>Quality assurance / Testing: 18 Hours</span></li> \n <li><span>ASE-Day: 2 Hours</span></li> \n</ul> \n<p><strong>Total: 150 hours (6 ECTS)</strong></p>"
        },
        "lectureNotes": {
            "de": "<p>Grechenig, T., Bernhart, M., Breiteneder, R., Kappel, K. (2009): Softwaretechnik - Mit Fallbeispielen aus realen Projekten. Verlag Pearson Studium, M&uuml;nchen, Germany.</p>",
            "en": "<p>Grechenig, T., Bernhart, M., Breiteneder, R., Kappel, K. (2009): Softwaretechnik - Mit Fallbeispielen aus realen Projekten. Verlag Pearson Studium, M&uuml;nchen, Germany.</p>"
        },
        "examinationModalities": {
            "de": "<p><span>Die notwendigen Voraussetzungen werden zu Beginn der Lehrveranstaltungen anhand eines Einstiegstests überprüft. Dieser muss positiv absolviert werden. Die weitere Leistungsfeststellung erfolgt im Rahmen von mehreren Managementreviews während der Projektlaufzeit.</span></p>",
            "en": "<p><span>The necessary qualifications are checked at the beginning of the courses on the basis of an entrance test. This must be passed positively. The further assessment of performance takes place within the framework of several management reviews during the project phase.</span></p>"
        },
        "related": {
            "recommendation": {
                "de": "<p><span>Grundlegende Kenntnisse aus Software Engineering und Projektmanagement</span></p>",
                "en": "<p><span>Basic knowledge of Software Engineering and Projectmanagement</span></p>"
            }
        },
        "weeklyHours": "4.0",
        "lecturers": {
            "oid": [
                "140721",
                "1709493",
                "2283789"
            ]
        },
        "tutors": {
            "oid": [
                "23966449",
                "10256529",
                "19957397"
            ]
        },
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tuwel.tuwien.ac.at/course/view.php?id=222",
        "uses54EctsRule": "false",
        "registration": "EXTERNAL",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?id=222",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "183252",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Softwareprojekt-Beobachtung und -Controlling",
            "en": "Monitoring and Controlling of Software Projects"
        },
        "objective": {
            "de": "<p>Softwareprojekt-Beobachtung und Controlling zielt auf jene Ebene der Sichtweise von IT- und Software-Projekten ab, die oberhalb des klassischen Projektmanagements in der Softwareentwicklung liegt und unterhalb des sehr übergreifenden IT-Controllings als gesamtbetriebliche Instanz. System-Einführung und System-Bau von Software geschieht in mittelgrossen und grossen betrieblichen Organisationen heute laufend und vielfältig, sodass eine Klassifizierung, ein Vergleich, ein Versehen mit Kennziffern, das Benchmarking und Evaluieren dieses Portfolios erforderlich ist. Die LVA will diese Tätigkeiten erläutern und die Absolventen darin ausbilden.</p>",
            "en": "<p>\"Software project monitoring and controlling\" aimes to view software development projects at a level above the traditional project management and still below the very comprehensive IT controlling authority. <br><br>Today system implementation and system-building of software is a complex task done in mid-sized and large operational organizations, thus a classification, benchmarking and an evaluation of this portfolio is important and required. This course will explain different benchmarking possibilites and train the students in a company wide controlling and prozess improvement.</p>"
        },
        "teachingContent": {
            "de": "<p>Die Lehrveranstaltung Softwareprojekt-Beobachtung und -Controlling befasst sich mit der strategischen qualitätserzeugenden Supervision von SW- und IT-Projekten:</p> \n<ul> \n <li>Transparenz: Zeit, Kosten und Qualität der SW Herstellung sichtbar machen&nbsp;</li> \n <li>Supervision: Überwachung und Eskalationsmechanismus&nbsp;</li> \n <li>Strategie: Analyse und Behebung von Fehlstellungen in der SW Erzeugung; SE Theorie vs. SE Praxis&nbsp;</li> \n <li>Vergleichbarkeit: Controlling über mehrere SW Projekte innerhalb eines Unternehmens und darüber hinaus</li> \n</ul> \n<p>Typische planerische und methodische Schwachstellen in der Praxis sollen anhand von konkreten Projekt- und System-Beobachtungen identifiziert und erlebt werden. Ihre Behebung im konkreten Umfeld wird in der Gruppe konzipiert und diskutiert.</p> \n<p><strong>Didaktisches Vorgehen:</strong> Im Rahmen der Vorlesung werden ergänzende Gastvorträge angeboten. Der Übungsteil wird im Team absolviert und umfasst folgende Themen:</p> \n<ul> \n <li>SW-Projektstatusbewertung mit der Earned-Value Methode&nbsp;</li> \n <li>Beobachtung und Bewertung eines ausgewählten Unternehmens anhand&nbsp;von konkreten Projekten&nbsp;</li> \n <li>Erarbeitung eines Konzept für SW-Multiprojektcontrolling&nbsp;</li> \n <li>Controlling Casestudy, -Analyse und -Managementberatung (für ein reales SW-erzeugendes Unternehmen)</li> \n</ul>",
            "en": "<p>The course \"Software Project Monitoring and Controlling\" deals with the strategic quality-producing supervision of software- and IT-projects:</p> \n<ul> \n <li>Transparency: Make time, costs and quality of software manufacturing visible</li> \n <li>Supervision: The supervision and escalation mechanism</li> \n <li>Strategy: Analysis and correction of problems occurring during the software productions; SE theory vs. SE practice&nbsp;</li> \n <li>Comparability: Controlling and comparing all software projects within an enterprise over a period of time</li> \n</ul> \n<p>Typical planning and methodological weaknesses in practice should be identified by analyzing real projects and systems. Possible solutions are designed and discussed within the group. <br><br><strong>Didactic Approach:</strong> The course is offered as a weekly lecture with additional guest lectures. The exercise, which is done in a team, includes the following topics:</p> \n<ul> \n <li>Software project status evaluation using the Earned Value Method</li> \n <li>Monitoring and evaluation of a company based on its projects&nbsp;</li> \n <li>Development of a concept for multi-project-controlling in&nbsp; software company</li> \n <li>Controlling Case Study, analysis and management consulting (for a real software producing company)</li> \n</ul>"
        },
        "additionalInformation": {
            "de": "<p><strong>Aufwandsschätzung (ECTS-Breakdown):</strong></p> \n<p><strong>Vorlesungsteil (45 h):</strong></p> \n<ul> \n <li>Vorbesprechung: 1 h</li> \n <li>Vorlesungseinheiten: 15 h</li> \n <li>Vertiefende Recherchen: 29 h</li> \n</ul> \n<p><strong>Übungsteil (105 h):</strong></p> \n<ul> \n <li>Analyse und Bewertungen: 50 h</li> \n <li>Konzepterstellung: 20 h</li> \n <li>Entwurf: 20 h</li> \n <li>Vorbereitung der Präsentation: 5 h</li> \n <li>Präsentationen: 2 h</li> \n <li>Besprechungen: 8 h</li> \n</ul> \n<p>---------------------------------------------------&nbsp;</p> \n<p><strong>Summe: 150 Stunden (6 ECTS)</strong>&nbsp;</p>",
            "en": "<p><strong>Effort for the student (ECTS-Breakdown)</strong>:</p> \n<p><strong>Lecture (45 h):</strong></p> \n<ul> \n <li>Preliminary Talk: 1 h</li> \n <li>Lectures: 15 h</li> \n <li>Self studies and further investigations: 29 h</li> \n</ul> \n<p><strong>Practical work (105 h):</strong></p> \n<ul> \n <li>Analysis and evaluation: 50 h</li> \n <li>Concept: 20 h</li> \n <li>Design: 20 h</li> \n <li>Preparation of presentation: 5 h</li> \n <li>Presentations: 2 h</li> \n <li>Meetings: 8 h</li> \n</ul> \n<p>---------------------------------------------------&nbsp;</p> \n<p><strong>Total: 150 hours (6 ECTS)</strong></p>"
        },
        "lectureNotes": {
            "de": "<p>Alle Kursunterlagen sind in TUWEL&nbsp;zu finden.</p>\r\n<p>Empfohlenes Buch:</p>\r\n<p>Grechenig, T., Bernhart, M., Breiteneder, R., Kappel, K. (2009): Softwaretechnik - Mit Fallbeispielen aus realen Projekten. Verlag Pearson Studium, M&uuml;nchen, Germany</p>",
            "en": "<p>Grechenig, T., Bernhart, M., Breiteneder, R., Kappel, K. (2009): Softwaretechnik - Mit Fallbeispielen aus realen Projekten. Verlag Pearson Studium, M&uuml;nchen, Germany</p>"
        },
        "examinationModalities": {
            "de": "<p><span>Abgabe von Übungen, Abgabegespräche bzw. -präsentationen.</span></p>",
            "en": "<p><span>Hand-in of coursework, delivery talks and/or presentations.</span></p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "4.0",
        "lecturers": {
            "oid": [
                "1709493",
                "3182105"
            ]
        },
        "tutors": {
            "oid": "17915637"
        },
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "http://www.inso.tuwien.ac.at/lectures/probeocon/",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=183252-2019S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "183577",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Pilots in Mobile Interaction: User-centered Interaction Research and Evaluation",
            "en": "Pilots in Mobile Interaction: User-centered Interaction Research and Evaluation"
        },
        "objective": {
            "de": "<p>Das Forschungsgebiet \"nutzerzentrierte Interaktion\" beschäftigt sich mit innovativen Wegen zur Unterstützung von Mensch-Maschine-Interaktion (Human-Computer Interaction HCI) von zukünftigen Netzdiensten wie auch mit fortgeschrittenen Methoden für nutzerzentriertes Design und Quality-of-Experience (QoE)-Bewertung solcher Systeme. In dieser Lehrveranstaltung werden aktuelle Entwicklungen und Trends in diesem hochinteressanten Gebiet vorgestellt und diskutiert, darunter insbesondere kontextbasierte Interaktionstechniken für multimodale mobile Applikationen (mit besonderem Schwerpunkt auf Mobile Spatial Interaction), nutzerzentrierte Design-, Prototyping- und Qualitätsbewertungsmethoden für verteilte Multimediadienste und sozio-ökonomische Ansätze zu Netzmanagement und Stakeholder-orientierter Innovation. Aufbauend auf Usability Engineering und Interface und Interaction Design präsentiert diese Lehrveranstaltung daher einen breiten Überblick über nutzerzentrierte Interaktionsforschung und konzentriert sich insbesondere auf das Gebiet der mobilen Interaktion und dessen Besonderheiten sowohl im Design als auch in der Evaluierung.</p>",
            "en": "<p>The research area of user-centered interaction concentrates on innovative ways for supporting Human Computer Interaction (HCI) for networked systems as well as advanced methods for user-centric design and quality of experience evaluation of such systems. This course aims at presenting and discussing current developments and trends in this highly interesting field, including situation-aware interaction techniques for multimodal mobile applications (with a specific focus on Mobile Spatial Interaction), advanced user-centric design, prototyping, and quality evaluation methods for networked multimedia services, and socio-economic approaches for network management and stakeholder-oriented innovation. Based on Usability Engineering and Interface and Interaction Design, this course will thus give a broad overview on user-centered interaction research and particularly emphasize the area of mobile interaction, its design and evaluation.</p>"
        },
        "teachingContent": {
            "de": "<p>Vorlesungen werden zu den folgenden Themen abgehalten:</p> \n<ul> \n <li>From QoS to QoE to Data-Driven Experience&nbsp;</li> \n <li>Quality of Experience: Methods &amp; Applications&nbsp;</li> \n <li>Perceptual Quality for Mediated Interaction</li> \n <li>Prototyping for Future Mobile Interactions + Case Studies</li> \n <li>Evaluation of Future Mobile Interactions + Case Study</li> \n <li>Technology Acceptance</li> \n <li>Exkursion an das AIT: Teilnahme an Führung und Nutzerstudie für ein ausgewähltes Forschungsprojekt&nbsp;</li> \n <li>Case Study in Interaction Design</li> \n <li>Presentation Day</li> \n</ul> \n<p><strong>Didaktische Vorgehensweise:</strong><br>Im Rahmen der VU werden zunächst Vorlesungen zu aktuellen Forschungsthemen im Bereich der User-centered Research gegeben, die im Rahmen der Übung vertieft werden. Abschließend werden die Ergebnisse der Recherchen in Vorträgen präsentiert.</p>",
            "en": "<p><strong>Lectures:</strong></p> \n<ul> \n <li>From QoS to QoE to Data-Driven Experience&nbsp;</li> \n <li>Quality of Experience: Methods &amp; Applications&nbsp;</li> \n <li>Perceptual Quality for Mediated Interaction</li> \n <li>Prototyping for Future Mobile Interactions + Case Studies</li> \n <li>Evaluation of Future Mobile Interactions + Case Study</li> \n <li>Technology Acceptance</li> \n <li>Exkursion an das AIT: Teilnahme an Führung und Nutzerstudie für ein ausgewähltes Forschungsprojekt&nbsp;</li> \n <li>Case Study in Interaction Design</li> \n <li>Presentation Day</li> \n</ul>"
        },
        "additionalInformation": {
            "de": "<p><strong><strong><strong><strong>Fragen bitte an&nbsp;<a href=\"mailto:teaching@inso.tuwien.ac.at\" rel=\"nofollow\">teaching@inso.tuwien.ac.at</a>&nbsp;richten.</strong></strong>&nbsp;</strong></strong></p> \n<p><strong><strong>Aufwandsschätzung</strong>&nbsp;(<strong>ECTS-Breakdown</strong>):</strong></p> \n<ul> \n <li>1h Vorbesprechung</li> \n <li>12h Vorlesung (=8 x 90 min)</li> \n <li>20h Vorbereitung Theorie (Literatur)</li> \n <li>20h Durchführung Forschungsprojekt</li> \n <li>16h Vorbereitung der Abschlusspräsentation</li> \n <li>6h Abschlusspräsentation</li> \n</ul> \n<p><strong>Summe: 75 Stunden (3 ECTS)</strong></p>",
            "en": "<p><strong>If you have any questions, please contact teaching@inso.tuwien.ac.at.</strong></p> \n<p><strong>Effort for the student (ECTS-Breakdown):</strong></p> \n<ul> \n <li>1h Preliminary talk</li> \n <li>12h Lectures (=8 x 90 min)</li> \n <li>20h Further investigations (Literature search)</li> \n <li>20h Practical investigations</li> \n <li>16h Preparation of the final presentation</li> \n <li>6h Final presentation</li> \n</ul> \n<p><strong>Total: 75 hours (3 ECTS)</strong></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Abgabe von Präsentationsfolien, Abhalten eines Abschlussreferats basierend auf eigener Literaturrecherche</p>",
            "en": "<p><span>Delivery of presentation slides, holding a final presentation based on own literature research</span></p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            },
            "accompanyingCourses": {
                "course": "183123"
            },
            "continuativeCourses": {
                "course": "183289"
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1709493",
                "1470213",
                "2429365",
                "3625457",
                "2783893"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=183577&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=183577-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "183595",
        "semesterCode": "2020S",
        "courseType": "PR",
        "title": {
            "de": "Bachelorarbeit für Informatik und Wirtschaftsinformatik",
            "en": "Bachelor thesis"
        },
        "objective": {
            "de": "<p>Ziel dieser Lehrveranstaltung ist die praktische Erfahrung in der Anwendung der verschiedenen Verfahren und Methoden der Informatik oder Wirtschaftsinformatik. Ziel ist auch das Sammeln von Erfahrungen in Themen der Informatik anhand konkreter Aufgabenstellungen und deren methodischer Umsetzung. Anhand eines relevanten Themas soll so die Verbindung aus soliden Grundlagen und guter Theorie mit wirklicher Projekterfahrung hergestellt werden. Als Dokumentation der selbständigen wissenschaftlichen Leistung wird eine Bachelorarbeit verfaßt.</p>",
            "en": "<p>Scientific work and presentation.</p>"
        },
        "teachingContent": {
            "de": "<p>Im Rahmen dieser Lehrveranstaltung wird ein aktuelles Thema aus den Forschungsbereichen der Forschungsgruppe Industrielle Software bearbeitet. Zur Auswahl stehen Themen aus den Bereichen:</p> \n<ul> \n <li>Software Engineering und Qualitätssicherung</li> \n <li>Human-Computer Interaction und Usability Engineering</li> \n <li>IT Security, eHealth, elektronische Gesundheitsakten</li> \n <li>E-Government, E-Voting, elektronischer Akt</li> \n <li>Mobile Applikationen und Mobile Gesellschaft</li> \n <li>Betriebliche Informationssysteme und Projektmanagement&nbsp;</li> \n <li>und andere relevante informatische Fragestellungen.&nbsp;</li> \n</ul> \n<p>Nähere Informationen finden Sie&nbsp;<a href=\"https://www.inso.tuwien.ac.at/#research\" rel=\"nofollow\">hier</a>. Der konkrete Umfang Ihrer Bachelorarbeit wird gemeinsam mit der LVA Leitung festgelegt und hängt vom gewählten Thema und der Themenkomplexität ab. Für eigene Themenvorschläge ist die Ausarbeitung einer schriftlichen Projektbeschreibung erforderlich, wobei Titel, Zielsetzung, Inhalt und Einzelheiten zur Planung enthalten soll. &nbsp;&nbsp;<span>&nbsp;</span></p>",
            "en": "<p>This course deals with a current topic from the research areas of the Industrial Software Research Group. Topics from the areas are available for selection:</p> \n<ul> \n <li><span>Software Engineering and Quality Assurance</span></li> \n <li><span>Human-Computer Interaction and Usability Engineering</span></li> \n <li><span>IT security, eHealth, electronic health records</span></li> \n <li><span>e-Government, e-Voting, electronic file</span></li> \n <li><span>Mobile applications and mobile society</span></li> \n <li><span>Operational information systems and project management&nbsp;</span></li> \n <li><span>and other relevant informatics issues.</span></li> \n</ul> \n<p>More details and topics&nbsp;<a href=\"https://www.inso.tuwien.ac.at/#research\" rel=\"nofollow\">here</a>.&nbsp;The concrete scope of your bachelor thesis will be determined together and depends on the chosen topic and the complexity of the topic. For your own topic proposal, it is necessary to prepare a written project description, including the title, objectives, content, and details of the planning.</p>"
        },
        "additionalInformation": {
            "de": "<p>AKTUELLE INFORMATIONEN:<br>Entsprechend des Maßnahmenkatalogs der Regierung ist die Präsenzlehre ab Mi, den 11.03. auszusetzen. Bitte melden Sie sich zur LVA hier in TISS an, damit wir Ihre Kontaktdaten haben<br>und Ihnen die Unterlagen zukommen lassen können. Sie können auch gerne eine mail an <a href=\"mailto:care4u@inso.tuwien.ac.at\" rel=\"nofollow\">care4u@inso.tuwien.ac.at</a>&nbsp;schicken, damit wir Sie auf die Vormerkliste nehmen und über die geeignete Informationsübermittlung informieren können.</p> \n<p>Themenvorschläge finden Sie auf unserer&nbsp;<a href=\"https://www.inso.tuwien.ac.at/#research\" rel=\"nofollow\">INSO-Homepage</a>, Sie können dort ein thematisch passendes Thema auswählen und den entsprechenden Betreuer direkt anschreiben.<br>Oder Sie kommen zu unserer Vorbesprechung, hier werden aktuelle Themen präsentiert.</p> \n<p><strong>ECTS-Breakdown (Aufwandsschätzung)</strong> - wird je nach Themenstellung angepaßt:</p> \n<ul> \n <li>Schreiben des Exposés: 10 h</li> \n <li>Themenfindung, Literaturrecherchen, Erhebung des State-of-the-Art: 30 h</li> \n <li>Einarbeitung in die Technologien/ Methoden: 20 h</li> \n <li>Praktischer Teil (Implementierung/ Erhebungen): 120 h</li> \n <li>Evaluierung/ Testen: 30 h</li> \n <li>Schreiben der Arbeit: 40 h</li> \n</ul> \n<p><strong>Summe:</strong> 250 Stunden (10 ECTS)</p> \n<p><span>Allgemeine Anfragen richten Sie bitte an </span><a href=\"mailto:care4u@inso.tuwien.ac.at\" rel=\"nofollow\">care4u@inso.tuwien.ac.at</a><span>.</span></p>",
            "en": "<p>CURRENT INFORMATION:<br>According to the government's catalogue of measures, classroom teaching is to be suspended from Wednesday 11 March. Please register for the LVA here in TISS, so that we have your contact details<br>and send you the documents. You are also welcome to send an e-mail to care4u@inso.tuwien.ac.at so that we can inform you about the appropriate information transfer.</p> \n<p><strong>Effort for the student (ECTS-Breakdown)</strong>&nbsp;- for example</p> \n<ul> \n <li>Exposé writing: 10 h</li> \n <li>Literature research, analysis work, State-of-the-Art: 30 h</li> \n <li>Familiarization&nbsp;with the<strong>&nbsp;</strong>given development environment and with the technologies applied: 20 h</li> \n <li>Practical part (implementation/ survey): 120 h&nbsp;</li> \n <li>Evaluation/ testing: 30 h</li> \n <li>Thesis writing: 40 h</li> \n</ul> \n<p><strong>Total:</strong>&nbsp;250 h (10 ECTS)</p> \n<p><span>If you have any questions, please contact </span><a href=\"mailto:care4@inso.tuwien.ac.at\" rel=\"nofollow\">care4u@inso.tuwien.ac.at</a><span>.</span></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>LV-Immanente Leistungsbeurteilung (Präsentationen, Zwischenabgaben) und Qualität des fertigen Dokumentes, sowohl praktisch als auch hinsichtlich der Aufbereitung</p>",
            "en": "<p>LV-Immanent performance assessment (presentations, intermediate deliveries) and quality of the finished document, both practical and in terms of presentation</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "5.0",
        "lecturers": {
            "oid": "1709493"
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=183595&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=183595-2020S",
        "language": {
            "de": "bei Bedarf in Englisch",
            "en": "if required in English"
        }
    },
    {
        "courseNumber": "183635",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "eHealth in Theorie und Praxis",
            "en": "eHealth in Theory and Practice"
        },
        "objective": {
            "de": "<p>Ziel der Lehrveranstaltung ist die Vermittlung der grundlegenden Aspekte der Domäne eHealth. Theoretische Grundlagen, Konzepte, wissenschaftliche Betrachtungsweisen, Anforderungen werden in praktische Anwendungen, Umsetzungsvarianten und Erfahrungen übergeleitet. Die theoretisch vermittelten Inhalte werden in einer darauf aufbauenden Übung vertieft und stellen den praktischen Bezug zur Materie her.</p>",
            "en": "<p>This lecture gives an overview of the basic aspects of the eHealth domain. Theoretical foundations, concepts, scientific approaches and requirements are translated into practical applications, implementation options, and experiences. The theoretical content imparted in a constructive exercise in order to build and set forth the practical relevance to the topic.</p>"
        },
        "teachingContent": {
            "de": "<p>Konkret werden im Vorlesungsteil unter anderem folgende theoretische Fragen zum Thema eHealth diskutiert:</p> \n<ul> \n <li>Definition und Abgrenzung</li> \n <li>Domänen, Stakeholder, Anwendungen</li> \n <li>Ziele und Probleme</li> \n</ul> \n<p>Darauf aufbauend werden in der Vorlesung konkrete eHealth Projekte vorgestellt, um einen praktischen Bezug zu den theoretisch vermittelten Inhalten herzustellen.<br><br>Parallel zur Vorlesung wird eine begleitende Übung abgehalten, in der die in der Vorlesung vermittelten Inhalte konkretisiert werden. In der Übung werden sich die Studenten in der Gruppe mit konkreten eHealth-Anwendungen in unterschiedlichen Einsatzszenarien praktisch auseinandersetzen, diese analysieren, prototypisch umsetzen und vorstellen.</p>",
            "en": "<p>Within this lecture the following theoretical content on will be discussed:</p> \n<ul> \n <li>Definition and scope</li> \n <li>Domain, stakeholders, applications</li> \n <li>Goals and problems</li> \n</ul> \n<p>Based on this foundation, the lecture will present specific e-health projects to produce a practical reference to the mediated theoretical contents.</p>"
        },
        "additionalInformation": {
            "de": "<p><strong>Aufwandsschätzung (ECTS-Breakdown):</strong></p> \n<p>Vorbesprechung: 2h<br>Vorlesungseinheiten: 6h<br><span>Übungsausarbeitungen:</span>: 107h<br><span>Präsentation der Ergebnisse inkl. Ausarbeitung: 10h</span><br>---------------------------------------------------&nbsp;</p> \n<p><strong>Summe: 125 Stunden (5 ECTS)</strong></p> \n<p><strong><br></strong></p>",
            "en": "<p><strong>Effort for the student (ECTS-Breakdown)</strong>:<br>Preliminary Talk: 2h<br>Lectures: 6h<br><span>Self study - exercises:</span>: 107h<br><span>Presentation of the results: 10 h</span></p> \n<p>---------------------------------------------------&nbsp;</p> \n<p><strong>Total: 125 hours (5 ECTS)</strong>&nbsp;</p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Präsentation und Entwicklung einer&nbsp;eHealth-Anwendungen&nbsp;(Gruppenarbeit)</p> \n<ul> \n <li>Anwesenheitspflicht!</li> \n <li>Keine schriftliche Prüfung</li> \n</ul> \n<p>Benotung erfolgt ausschließlich durch Abgabe und Präsentation der Gruppenarbeit (prototypische Umsetzung einer eHealth-Anwendungen&nbsp;Anwendung)</p>",
            "en": "<p>Presentation and development of a&nbsp;eHealth&nbsp;application (group work)</p> \n<ul> \n <li>Attendance Required!</li> \n <li>Language German</li> \n</ul> \n<p>Grading is done exclusively by presenting the group work (prototype implementation of a eHealth&nbsp;application).</p>"
        },
        "related": {
            "recommendation": {
                "de": "<p><span>keine besonderen Vorkenntnisse erforderlich</span></p>",
                "en": "<p><span>no particular previous knowledge necessary</span></p>"
            },
            "precedingCourses": {
                "course": "183253"
            }
        },
        "weeklyHours": "4.0",
        "lecturers": {
            "oid": [
                "1709493",
                "3313469",
                "7275665",
                "140721"
            ]
        },
        "tutors": {
            "oid": [
                "23322377",
                "27173893"
            ]
        },
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=183635&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=183635-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "183652",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Software Quality Management",
            "en": "Software Quality Management"
        },
        "objective": {
            "de": "<p>Erwerb von vertiefenden Kenntnissen im Bereich der Software Qualitätssicherung und des Software Qualitätsmanagements.<br>Erlangen der Fähigkeit, die Qualität eines Softwareprodukts zu beurteilen und Schritte zur nachhaltigen Verbesserung der Qualität&nbsp;von Software und Entwicklungsprozess zu identifizieren. Im Fokus steht das Kennenlernen und Anwenden praxisrelevanter Werkzeuge zur<br>Unterstützung von Tätigkeiten der Analyse, Verbesserung sowie fortschreitenden Überwachung (Monitoring) der Qualität.</p>",
            "en": "<p>The aim of this course is to deepen knowledge of concepts and methods in the field of quality assurrance and quality management.<br>Students improve their ability to assess and increase the quality of a software product and its development process.<br>Common tools to support activities concerning the evaluation, improvement and monitoring of software quality are introduced and pratically applied.</p>"
        },
        "teachingContent": {
            "de": "<p>Im Rahmen dieser Lehrveranstaltung werden fortgeschrittene Themen und Konzepte der Software Qualitätssicherung und des Software Qualitätsmanagements behandelt. Besonderer Fokus wird auf den Themenbereich Code Qualität und statische Code Analyse gelegt.</p> \n<p>Folgende Themenschwerpunkte werden in dieser LVA behandelt:</p> \n<ul> \n <li>Organisatorische, dynamische und statische Qualitätssicherung</li> \n <li>Statische Code Analyse</li> \n <li>Code Qualität</li> \n <li>Technische Schuld</li> \n <li>Qualitätsmetriken</li> \n <li>Moderne Code Reviews</li> \n <li>Werkzeuge zur Analyse und Überwachung von Software Qualität</li> \n <li>Qualitätsmanagement</li> \n</ul>",
            "en": "<p>This course covers advanced topics and concepts in the area of software quality assurance and software quality management. Special focus is placed on the area of continuous code quality and static code analysis.</p> \n<p>The following topics are covered during the course:</p> \n<ul> \n <li>organisational, dynamic and static quality assurance</li> \n <li>static code analysis</li> \n <li>code quality</li> \n <li>technical debt</li> \n <li>quality metrics</li> \n <li>modern code reviews</li> \n <li>tools for software quality assessment</li> \n <li>quality management</li> \n</ul>"
        },
        "additionalInformation": {
            "de": "<p><strong>Aufwandsschaetzung (ECTS-Breakdown):</strong></p> \n<ul> \n <li> <p>Vorlesungen: 10 h<br>Übungen: 45 h<br>Erstellung des Papers: 15 h<br>Endpräsentation: 5 h</p> </li> \n</ul> \n<p><strong>Summe: 75 Stunden (3 ECTS)</strong></p>",
            "en": "<p><strong>Effort for the student (ECTS-Breakdown):</strong><br><br></p> \n<ul> \n <li> <p>Lecture: 10 h<br>Practical Part: 45 h<br>Paper: 15 h<br>Presentation: 5 h</p> </li> \n</ul> \n<p><strong>Total: 75 hours (3 ECTS)</strong></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Der Leistungsnachweis ergibt sich wie folgt:</p> \n<ul> \n <li>Übungsaufgaben in Kleingruppen, in deren Rahmen schrittweise die Qualität eines Softwareprodukts analysiert und mittels Einführung und Vernetzung von geeigneten Werkzeugen kontinuierlich überwacht wird</li> \n <li>Präsentation der Ergebnisse der Qualitätsanalyse</li> \n <li>Verfassen eines Qualitätsberichts</li> \n</ul>",
            "en": "<p>The evaluation of performance is as follows:</p> \n<ul> \n <li>Exercises in small groups, during which the quality of a software product is analysed and a tool chain for continuous tracking and impovement of software quality is established step by step</li> \n <li>Presentation of the results within small groups</li> \n <li>Writing of a formal quality report</li> \n</ul>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1709493",
                "3183789",
                "2283789"
            ]
        },
        "tutors": {
            "oid": "16243869"
        },
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=183652&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=183652-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "183653",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Methodisches, industrielles Software-Engineering mit Funktionalen Sprachen am Fallbeispiel Haskell",
            "en": "Methodical, industrial Software-Engineering using the Haskell functional language"
        },
        "objective": {
            "de": "<p>Der heute industriell weit verbreitete Ansatz der objektorientierten&nbsp;(OO) Programmierung sowie des OO-Programmierstils ist zwar durchaus&nbsp;wirtschaftlich erfolgreich, jedoch lassen sich damit einige praktisch&nbsp;sehr relevante Problemstellungen bzw. Algorithmen nicht besonders \"natürlich\" darauf abbilden. Darüberhinaus haben sich die gängigen&nbsp;Rechnerarchitekturen seit dem Design der populären OO-Sprachen&nbsp;vielfältig weiterentwickelt (Multicore-Prozessoren,&nbsp;Speicherzugriffslatenzen, Cloud-Computing, usw.) und stellen nun&nbsp;andere Anforderungen und Randbedingungen an die Abstraktionen der&nbsp;Implementationssprache. Aus diesen Gründen haben in den letzten Jahren&nbsp;Funktionale Programmiersprachen (FP) wie Haskell viel Aufwind&nbsp;bekommen, da diese u.a. auch dafür entworfen wurden, auf die&nbsp;Programmierung moderner Rechnerarchitekturen besser zugeschnitten zu&nbsp;sein. Gerade in kritischen, großen Systemlösungen kommen hier&nbsp;inzwischen diese Ansätze vermehrt zur Anwendung.<br><br>Diese LVA soll Studierenden sowohl die nötigen Konzepte vermitteln, um&nbsp;große, praxisrelevante Softwareprojekte mit einer FP-Sprache wie&nbsp;Haskell umsetzen zu können, als auch mit den Stärken (und Schwächen)&nbsp;von FP-Sprachen gegenüber traditionellen OO-Sprachen vertraut machen,&nbsp;um bei konkreten, größeren Softwareprojekten von Fall zu Fall abwägen&nbsp;zu können, welches Modellierungsparadigma besser zur Umsetzung&nbsp;geeignet ist.</p>",
            "en": "<p>tbd</p>"
        },
        "teachingContent": {
            "de": "<p><strong>Teil 1</strong></p> \n<ul> \n <li>Überblick/Kurzwiederholung der <em>Haskell2010</em>&nbsp;Grundsprache, wichtiger&nbsp;Spracherweiterungen und des Haskell \"Ökosystems\" (Compiler,&nbsp;Build-System, Software Repositories, Tools, Community)</li> \n <li>Werkzeuge der Abstraktionen in Haskell: Funktionen, (Daten)typen,&nbsp;GADTs, Lazyness, Typklassen, Monaden &amp; EDSLs</li> \n <li>Metaprogrammierung mit <em>TemplateHaskell</em>, <em>QuasiQuotation</em>&nbsp;&amp; Generics</li> \n</ul> \n<p><strong>Teil 2</strong></p> \n<ul> \n <li>Verständnis und Optimierung der Laufzeiteigenschaften (Zeit- &amp;&nbsp;Speicherbedarf) von GHC-Haskell Programmen</li> \n <li>Skalierbarkeit in Haskell: Parallelisierung &amp; Nebenläufigkeit</li> \n <li><em>CloudHaskell</em></li> \n <li>Vereinbarkeit von Ein/Ausgabe, Seiteneffekte &amp;&nbsp;Datenstrukturmutation mit \"reiner\" Funktionaler Programmierung</li> \n <li>Netzwerkprogrammierung (Vom einfachen TCP/IP Server zu JSON-RPC/HTTP Web-Services)</li> \n <li>Einbindung bestehender C-Libraries mittels Foreign Function Interface (FFI)</li> \n</ul> \n<p><strong>Teil 3</strong></p> \n<ul> \n <li>Design &amp; Entwicklung von \"High Assurance Software\" mit Haskell</li> \n <li>Ausnutzung des Typsystems für \"correct-by-construction\" Garantien&nbsp;durch Abbildung von Invarianten auf Typebene.</li> \n <li>&nbsp;<em>SafeHaskell</em></li> \n <li>Testen (und Verifizieren) von Haskell Programmen</li> \n</ul>",
            "en": "<p>Part 1</p> \n<ul> \n <li>Overview/short review of the Haskell2010 basic language, important language extensions and the Haskell \"ecosystem\" (compiler, build system, software repositories, tools, community)</li> \n <li>Tools of the abstractions in Haskell: functions, (data) types, GADTs, lazyness, type classes, monads &amp; EDSLs</li> \n <li>Metaprogramming with TemplateHaskell, QuasiQuotation &amp; Generics</li> \n</ul> \n<p>Part 2</p> \n<ul> \n <li>Understanding and optimization of the runtime characteristics (time &amp; memory requirements) of GHC-Haskell programs</li> \n <li>Scalability in Haskell: parallelization &amp; concurrency</li> \n <li>CloudHaskell</li> \n <li>Compatibility of input/output, side effects &amp; data structure mutation with \"pure\" functional programming</li> \n <li>Network programming (From simple TCP/IP server to JSON-RPC/HTTP web services)</li> \n <li>Integration of existing C libraries via Foreign Function Interface (FFI)</li> \n</ul> \n<p>Part 3</p> \n<ul> \n <li>Design &amp; development of \"High Assurance Software\" with Haskell</li> \n <li>Utilization of the type system for \"correct-by-construction\" guarantees by mapping invariants at type level.</li> \n <li>SafeHaskell</li> \n <li>Testing (and verifying) Haskell programs</li> \n</ul>"
        },
        "additionalInformation": {
            "de": "<p>Bei Fragen wenden Sie sich bitte an teaching@inso.tuwien.ac.at.</p> \n<p><strong>Aufwandsschätzung (ECTS-Breakdown):</strong></p> \n<ul> \n <li>Vorbesprechung: 1,5 h</li> \n <li>Vorlesungen (5 Einheiten à 2 Stunden): 7,5 h</li> \n <li>Eigenrecherchen: 11 h</li> \n <li>Übungsbeispiele: 45 h</li> \n <li>Abschlußpräsentation (inkl. Vorbereitung): 10 h</li> \n</ul> \n<p>---------------------------------------------------&nbsp;</p> \n<p><strong>Summe: 75 Stunden (3 ECTS)</strong></p>",
            "en": "<p><strong>Effort for the student (ECTS-Breakdown):</strong><br><br>Preliminary talk: 1,5 h<br>Lectures: 7,5 h<br>Self Study: 11 h<br>Exercises: 45 h<br>Final Presentation: 10 h</p> \n<p><strong>Total: 75 hours (3 ECTS)</strong></p>"
        },
        "lectureNotes": {
            "de": "<ul>\r\n<li>\"<a href=\"http://learnyouahaskell.com/\" target=\"_blank\">Learn You a Haskell for Great Good!</a>\"</li>\r\n<li>&nbsp;\"<a href=\"http://book.realworldhaskell.org/\" target=\"_blank\">Real World Haskell</a>\"</li>\r\n<li>\"C9 Lectures: Erik Meijer - <a href=\"http://channel9.msdn.com/Series/C9-Lectures-Erik-Meijer-Functional-Programming-Fundamentals\" target=\"_blank\">Functional Programming Fundamentals</a>\"</li>\r\n</ul>",
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Es gibt einen Vorlesungs- und einen Übungsteil, wobei die Bewertung&nbsp;aufgrund eines in Kleingruppen selbständig durchgeführten Softwareprojekts&nbsp;(inkl. kurzer Abschluspräsentation am Ende des Semesters) basiert.</p>",
            "en": "<p>There is a lecture and an exercise part, whereby the assessment is based on a software project carried out independently in small groups (including a short final presentation at the end of the semester).</p>"
        },
        "related": {
            "recommendation": {
                "de": "<p>Um dieser LVA leichter folgen zu können, werden Grundkenntnisse der&nbsp;Haskell Programmiersprache dringend empfohlen, die beispielsweise&nbsp;durch Besuch der VU \"Funktionale Programmierung\" oder alternativ&nbsp;durch Selbststudium der Literaturempfehlungen erlangt werden können.</p>",
                "en": "<p>Um dieser LVA leichter folgen zu können, werden Grundkenntnisse der&nbsp;Haskell Programmiersprache dringend empfohlen, die beispielsweise&nbsp;durch Besuch der VU \"Funktionale Programmierung\" oder alternativ&nbsp;durch Selbststudium der Literaturempfehlungen erlangt werden können.</p>"
            },
            "precedingCourses": {
                "course": "185A03"
            },
            "accompanyingCourses": {
                "course": "185A05"
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1709493",
                "3200445"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=183653&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=183653-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "183661",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Mobile (App) Software Engineering",
            "en": "Mobile (App) Software Engineering"
        },
        "objective": {
            "de": "<p>Das professionelle Entwickeln der relativ neuen Systemklasse Mobile Apps auf modernen Tablets und Smart-Phones ist aus ingenieurwissenschaftlicher Sicht, d.h. bezüglich der professionellen Durchführung eines Projektes, so wie es im modernen Software-Engineering üblich ist, heute noch methodisches Flickwerk. Dies hat unterschiedliche Gründe:</p> \n<ul> \n <li>Schwächen bei den bereitstehenden Frameworks</li> \n <li>Laufender Technologiewechsel durch starke Evolution der Geräte</li> \n <li>Veränderung der Technologie-Landschaft und der Sensoren</li> \n <li>Aufwändige Abstimmung der Themen Performance, Security, Usability, Interface Design, Marketing, Prozessveränderung in Abläufen verbunden mit der breiten Palette an Möglichkeiten</li> \n <li>Probleme der Ressourcen-Schonung für Methoden des Testens für die Technologie</li> \n <li>Aufkommen und Integrationsprobleme in die Themen IoT und M2M</li> \n <li>Mangelnde Verfügbarkeit von erfahrenen (App-)Ingenieuren</li> \n <li>Manglende globale Erfahrung mit dieser neuen Technologie</li> \n <li>Allgemeine Schwächen im Thema End2End-Engineering mit Mobile Apps als Endsystem</li> \n</ul> \n<p>Erfahrene Ingenieure von Großprojekten erleben das Development von mobile Apps als unstrukturiertes Basteln mit Stärken in manchen Themen- und Problembereichen, jedoch ohne profunden üblichen Gesamthalt und den Aufbau von Nachhaltigkeit. Oft wünschen sie sich andere Entwickler, ohne zu verstehen, dass die Probleme des Themas bzw. der Basis-Technologie schlicht Probleme der Jugend dieser neuen Disziplin sind. Eine Teiltechnologie wie NFC, ein wesentlicher Bestandteil der LVA für die kommenden 3 Jahre und fester Bestandteil der Umsetzung in der Industrie, ist technologisch aus jenem Teil der Elektro- und Mobilfunk-Technik gewachsen, die wenig Erfahrung mit Interaktions-Design der Kern-Informatik hatte. Das spürt man und solche Flaws müssen in konkreten Projekten dann nachgesteuert werden.</p> \n<p>In Summe gilt: Die Umsetzung von Lösungen mit Smart current und future Devices wird für einige Zeit aufwändig und semi-strukturiert bleiben. Die vorliegende LVA nähert sich diesem Thema aus der Sicht des Ingenieurs, Gesamtprojektmanagers und verantwortlichen (App-) Software-Ingenieurs. Keines der Einzelthemen der LVA kann das Gesamtproblem lösen, jedoch kann die Summe der Inhalte, Erfahrungen, Technologien und Vorschläge das mobile App-Development eine Spur professioneller machen. Das ist das Ziel der LVA.</p> \n<p>&nbsp;</p>",
            "en": "<p>tbd</p>"
        },
        "teachingContent": {
            "de": "<p>Das professionelle Entwickeln von Mobile Apps auf modernen Tablets und Smartphones ist aus ingenieurwissenschaftlicher Sicht, d.h. bezüglich der professionellen Durchführung eines Projektes, so wie es im modernen Software-Engineering üblich ist, heute noch methodisches Flickwerk. Dies hat unterschiedliche Gründe:</p> \n<p>- Schwächen bei den bereitstehenden Frameworks<br>- Laufender Technologiewechsel durch starke Evolution der Geräte<br>- Veränderung der Technologie-Landschaft und der Sensoren<br>- Aufwändige Abstimmung der Themen Performance, Security, Usability, Interface Design, Marketing, Prozessveränderung in Abläufen verbunden mit der breiten Palette an Möglichkeiten<br>- Probleme der Ressourcen-Schonung für Methoden des Testens für die Technologie<br>- Aufkommen und Integrationsprobleme in die Themen IoT und M2M<br>- Mangelnde Verfügbarkeit von erfahrenen (App-)IngenieurInnen<br>- Mangelnde globale Erfahrung mit dieser neuen Technologie<br>- Allgemeine Schwächen im Thema End2End-Engineering mit Mobile Apps als Endsystem</p> \n<p>Erfahrene Ingenieure und Ingenieurinnen von Großprojekten erleben das Development von Mobile Apps als unstrukturiertes Basteln mit Stärken in manchen Themen- und Problembereichen, jedoch ohne profunden üblichen Gesamthalt und den Aufbau von Nachhaltigkeit. Oft wünschen sie sich andere EntwicklerInnen, ohne zu verstehen, dass die Probleme des Themas bzw. der Basis-Technologie schlicht Probleme der Jugend dieser neuen Disziplin sind. Eine Teiltechnologie wie NFC, ein wesentlicher Bestandteil der LVA und fester Bestandteil der Umsetzung in der Industrie, ist technologisch aus jenem Teil der Elektro- und Mobilfunk-Technik gewachsen, die wenig Erfahrung mit Interaktions-Design der Kern-Informatik hatte. Das spürt man und solche Schwächen müssen in konkreten Projekten nachgesteuert werden.</p> \n<p>In Summe gilt: Die Umsetzung von Lösungen mit Smart (current and future) Devices wird für einige Zeit aufwändig und semi-strukturiert bleiben. Die vorliegende LVA nähert sich diesem Thema aus der Sicht des/der Gesamtprojektmanagers/in und verantwortlichen (App-) Software-Ingenieurs/in. Keines der Einzelthemen der LVA kann das Gesamtproblem lösen, jedoch kann die Summe der Inhalte, Erfahrungen, Technologien und Vorschläge das mobile App-Development eine Spur professioneller machen. Das ist das Ziel der LVA.</p>",
            "en": "<p>The professional development of mobile apps on modern tablets and smartphones is still a methodical patchwork from an engineering point of view, i.e. with regard to the professional execution of a project, as it is common in modern software engineering. There are various reasons for this:</p> \n<p>- Weaknesses in the available frameworks<br>- Ongoing technology change due to strong evolution of the devices<br>- Change in the technology landscape and sensors<br>- Elaborate coordination of the topics performance, security, usability, interface design, marketing, process changes in workflows combined with the wide range of possibilities<br>- Problems of resource conservation for methods of testing for the technology<br>- Emergence and integration problems in IoT and M2M<br>- Lack of availability of experienced (app) engineers<br>- Lack of global experience with this new technology<br>- General weaknesses in End2End-Engineering with Mobile Apps as end system</p> \n<p>Experienced engineers of large projects experience the development of mobile apps as unstructured tinkering with strengths in some topics and problem areas, but without the profound usual overall content and the building of sustainability. Often they wish other developers, without understanding that the problems of the topic or basic technology are simply problems of the youth of this new discipline. A partial technology like NFC, an essential part of the FVO and an integral part of its implementation in industry, has technologically grown out of that part of electrical and mobile communications technology which had little experience with interaction design of core computer science. This can be felt and such weaknesses must be addressed in concrete projects.</p> \n<p>All in all, the implementation of solutions with smart (current and future) devices will remain complex and semi-structured for some time. The present FVO approaches this topic from the perspective of the overall project manager and responsible (app) software engineer. None of the individual topics of the FVO can solve the overall problem, but the sum of the contents, experiences, technologies and suggestions can make the mobile app development a bit more professional. This is the goal of the LVA.</p>"
        },
        "additionalInformation": {
            "de": "<p><strong>Aufwandsschätzung (ECTS-Breakdown):</strong></p> \n<ul> \n <li>1h Vorbesprechung</li> \n <li>12h Vorlesung (=8 x 90 min)</li> \n <li>40h Durchführung des Übungsteils in Gruppen</li> \n <li>16h Vorbereitung der Abschlusspräsentation</li> \n <li>6h Abschlusspräsentation</li> \n</ul> \n<p><strong>Summe: 75 Stunden (3 ECTS)</strong></p> \n<p>Bei Fragen wenden Sie sich bitte an teaching@inso.tuwien.ac.at.</p>",
            "en": "<p><strong>Aufwandsschätzung (ECTS-Breakdown):</strong></p> \n<ul> \n <li>1h Vorbesprechung</li> \n <li>9 h Vorlesung (=8 x 90 min)</li> \n <li>45 h Durchführung des Übungsteils in Gruppen</li> \n <li>18 h Vorbereitung der Abschlusspräsentation</li> \n <li>2 h Abschlusstest</li> \n</ul> \n<p><strong>Summe: 75 Stunden (3 ECTS)</strong></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Ausarbeitung eines praktischen Beispiels (Entwicklung einer mobilen App) in Kleingruppen</p>",
            "en": "<p>practical assignment (development of a mobile app), to be completed in small groups</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": "1709493"
        },
        "tutors": {
            "oid": [
                "9770409",
                "11779281"
            ]
        },
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=183661-2016W",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=183661-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "183669",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Advanced Aspects of Connected Car IT",
            "en": "Advanced Aspects of Connected Car IT"
        },
        "objective": {
            "de": "<p>Das Ziel der Lehrveranstaltung ist die weiterführende Einführung in das Themengebiet Connected Car IT in der ganzheitlichen und tiefgreifenden Betrachtung.</p> \n<p>Dabei werden nicht nur die IT-technischen Belange in den Kontext gestellt, sondern das Thema ganzheitlich im gesamten Durchstich beleuchtet. Von der Geschäftsidee, der prototyphaften Erstimplementierung, den Anforderungen an Sicherheit und Datenschutz, der Integration in die Unternehmensprozesse, die Iterationen zur Reife der Lösung bis zur Livestellung mit dem verbundenen User Service erfahren Sie dieses Thema.</p> \n<p>Die Koexistenz des klassischen Step-By- Step Vorgehens in der Elektronikentwicklung der Fahrzeuge und der agilen, nutzerzentrierten Vorgehensweise im Design und Entwicklung der IT-Lösung werden als ganzheitlicher Ansatz vermittelt.</p> \n<p>Ein weiterer Themenblock der Vorlesungsreihe ist die Betrachtung des Lifecycles von Fahrzeugen und IT-Lösungen. Während Fahrzeuge und deren Technologien im Lifecycle bei 3-4 Jahren sind, erleben wir in der digitalen Welt der Smartphones ständig neue Technologien und tägliche Updates der Funktionen. Was kann Connected Car von Smartphones lernen und wie sollte ein Konzept der Entkopplung und losen Integration gestaltet sein – diese Frage werden wir gemeinsam beantworten.</p> \n<p>Am Ende der Lehrveranstaltungen haben Sie umfassende Kenntnisse über State-of-the-art Connected Car IT, Sie haben detaillierte Informationen zu den einzelnen Themenblöcken erhalten und Sie haben einen aktiven Part in den Vorlesungen durch Diskussionen eingenommen.</p>",
            "en": "<p>tbd</p>"
        },
        "teachingContent": {
            "de": "<p>Im Rahmen der Lehrveranstaltung werden Vorlesungen zu den folgenden Themen abgehalten:</p> \n<ul> \n <li>Connected CAR IT Einführung und Übersicht</li> \n <li>Weiterführende Geschäftsmodelle Connected Car IT</li> \n <li>Vorgehensweise Fahrzeugentwicklung und Conected Car Funktionen</li> \n <li>User Centric Design, Seamless Integration, Convenience</li> \n <li>Service-orientiertes Design vs. ingenieursgetriebener Genialität</li> \n <li>Integrationsszenarien in die Systemlandschaft</li> \n <li>IT-Security und Datenschutz&nbsp; im Wiederspruch zu Schwarmintelligenz und Mehrwertdienste</li> \n</ul>",
            "en": "<p>Within the course lectures are held on the following topics:</p> \n<p>Connected CAR IT Introduction and Overview<br>Further business models Connected Car IT<br>Approach Vehicle Development and Conected Car Functions<br>User Centric Design, Seamless Integration, Convenience<br>Service-oriented design vs. engineer-driven ingenuity<br>Integration scenarios in the system landscape<br>IT security and data protection in contradiction to swarm intelligence and value added services</p>"
        },
        "additionalInformation": {
            "de": "<p><strong>AKTUELLE INFORMATIONEN:</strong><br><span>Entsprechend des Maßnahmenkatalogs der Regierung ist die Präsenzlehre ab Mi, den 11.03. auszusetzen. Bitte melden Sie sich zur LVA hier in TISS an, damit wir Ihre Kontaktdaten haben</span><br><span>und Ihnen die Unterlagen zukommen lassen können. Sie können auch gerne eine mail an&nbsp;</span><a rel=\"nofollow\">care4u@inso.tuwien.ac.at</a><span>&nbsp;schicken, damit wir Sie auf die Vormerkliste nehmen und über die geeignete Informationsübermittlung informieren können.</span></p> \n<p>Fragen richten Sie bitte an care4u@inso.tuwien.ac.at.</p>",
            "en": "<p><strong>CURRENT INFORMATION:</strong><br><span>According to the government's catalogue of measures, classroom teaching is to be suspended from Wednesday 11 March. Please register for the LVA here in TISS, so that we have your contact details</span><br><span>and send you the documents. You are also welcome to send an e-mail to care4u@inso.tuwien.ac.at so that we can inform you about the appropriate information transfer.</span></p> \n<p>Fragen richten Sie bitte an care4u@inso.tuwien.ac.at.</p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Ausarbeitung von ausgewählten Themenbereichen, Bewertung einer Abschlußarbeit</p>",
            "en": "<p>Preparation of selected topics, evaluation of a final thesis</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            },
            "precedingCourses": {
                "course": "183668"
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1709493",
                "760641",
                "6421801"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=183669&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=183669-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "183670",
        "semesterCode": "2020S",
        "courseType": "PR",
        "title": {
            "de": "Cases in Engineering Connected Car IT Systems",
            "en": "Cases in Engineering Connected Car IT Systems"
        },
        "objective": {
            "de": "<p>Das Ziel der Praxisarbeit ist die Entwicklung und Optimierung anhand eines oder mehrerer konkreter Use-Cases der Connected Car IT-Applikationen. Die Aktivitäten des Praktikums decken alle Phasen eines Projekts ab: Geschäfts-/ Produktidee, Konzeption und Analyse sowie Design, Implementierung und Evaluierung und schließlich die laufenden Weiterentwicklungen.&nbsp;<br>Im Rahmen dieser Lehrveranstaltung werden Sie eine mobile Applikation für ein Android- oder iOS-Smartphone in einem iterativen Prozess konzipieren, prototypisch implementieren und evaluieren. Sie durchlaufen und erlernen somit im Rahmen eines Semesters einen exemplarischen Produktentstehungs-Prozess in der Praxis für Connected Car Services. Aufbauend auf \"Usability Engineering\" sowie \"Interface und Interaction Design\" präsentiert diese Lehrveranstaltung ausgewählte Aspekte speziell für die Systemklasse \"Mobile Apps\" und bietet die Grundlage für die Entwicklung von Mobile Application User Interfaces.</p>",
            "en": "<p>tbd</p>"
        },
        "teachingContent": {
            "de": "<p>Im Rahmen der Lehrveranstaltung werden Vorlesungen zu den folgenden Themen abgehalten:</p> \n<ul> \n <li><span>Entwicklung Geschäftsideen/Produktvisionen zu Connected Car IT</span></li> \n <li><span>Design Thinking-Methodik, User centric design</span></li> \n <li><span>Produktentstehung: Agiles Delivery (Scrum of scrum, DevOps)</span></li> \n <ul> \n  <li><span>Konzeption/ Analyse</span></li> \n  <li><span>Design</span></li> \n  <li><span>Implementierung</span></li> \n  <li><span>Evaluierung</span></li> \n  <li><span>Wartung und Weiterentwicklung</span></li> \n </ul> \n <li><span>User Klinik</span></li> \n <li><span>Produkt/Service Management auf Basis DevOps&nbsp;</span></li> \n</ul>",
            "en": "<p>Lectures on the following topics will be held as part of the course:</p> \n<ul> \n <li><span>Development of business ideas/ product visions for Connected Car IT</span></li> \n <li><span>Design thinking methodology, user centric design</span></li> \n <li><span>Product development: Agile Delivery (Scrum of scrum, DevOps)</span></li> \n <ul> \n  <li><span>Conception/ Analysis</span></li> \n  <li><span>Design</span></li> \n  <li><span>Implementation</span></li> \n  <li><span>Evaluation</span></li> \n  <li><span>Maintenance and further development</span></li> \n </ul> \n <li><span>User Clinic</span></li> \n <li><span>Product/Service Management based on DevOps</span></li> \n</ul>"
        },
        "additionalInformation": {
            "de": "<p><strong>AKTUELLE INFORMATIONEN:</strong><br><span>Entsprechend des Maßnahmenkatalogs der Regierung ist die Präsenzlehre ab Mi, den 11.03. auszusetzen. Bitte melden Sie sich zur LVA hier in TISS an, damit wir Ihre Kontaktdaten haben</span><br><span>und Ihnen die Unterlagen zukommen lassen können. Sie können auch gerne eine mail an&nbsp;</span><a rel=\"nofollow\">care4u@inso.tuwien.ac.at</a><span>&nbsp;schicken, damit wir Sie auf die Vormerkliste nehmen und über die geeignete Informationsübermittlung informieren können.</span></p> \n<p>Bei Fragen wenden Sie sich bitte an <a href=\"mailto:care4u@inso.tuwien.ac.at\" rel=\"nofollow\">care4u@inso.tuwien.ac.at</a>.</p>",
            "en": "<p><strong>CURRENT INFORMATION:</strong><br><span>According to the government's catalogue of measures, classroom teaching is to be suspended from Wednesday 11 March. Please register for the LVA here in TISS, so that we have your contact details</span><br><span>and send you the documents. You are also welcome to send an e-mail to care4u@inso.tuwien.ac.at so that we can inform you about the appropriate information transfer.</span></p> \n<p>Bei Fragen wenden Sie sich bitte an <a href=\"mailto:care4u@inso.tuwien.ac.at\" rel=\"nofollow\">care4u@inso.tuwien.ac.at</a>.</p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Sowohl der Lösungsweg, dessen Dokumentation und die Endpräsentation fließen in die Benotung ein.</p>",
            "en": "<p>Both the solution, its documentation and the final presentation flow into the grading.</p>"
        },
        "related": {
            "recommendation": {
                "de": "<p>Grundlagen der Software Engineerings müssen vorhanden sein, das Praktikum \"Software Engineering und Projektmanagement\" muss absolviert sein, fortgeschrittene Programmierkenntnisse werden empfohlen.</p>",
                "en": "<p>Grundlagen der Software Engineerings müssen vorhanden sein, das Praktikum \"Software Engineering und Projektmanagement\" muss absolviert sein, fortgeschrittene Programmierkenntnisse werden empfohlen.</p>"
            },
            "precedingCourses": {
                "course": [
                    "183241",
                    "183289"
                ]
            },
            "accompanyingCourses": {
                "course": "183123"
            },
            "continuativeCourses": {
                "course": "183243"
            }
        },
        "weeklyHours": "4.0",
        "lecturers": {
            "oid": "1709493"
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=183670&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=183670-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "194051",
        "semesterCode": "2020S",
        "courseType": "PR",
        "title": {
            "de": "Interface and Interaction Design",
            "en": "Interface and Interaction Design"
        },
        "objective": {
            "de": "<p>* Anwendung der Grundlagen des Interface &amp; Interaction Designs im Rahmen einer praktischen Projektarbeit<br>* Entwicklung eines Design Konzepts anhand eines User Centered Design Prozesses</p>",
            "en": "<p>*&nbsp;Application of foundational principles in interface &amp; interaction design in a practical design project<br>* Development of a design concept through a user centered design process</p>"
        },
        "teachingContent": {
            "de": "<p>Begleitend zur VU Interface &amp; Interaction Design (183.289) bietet diese Lehrveranstaltung die Möglichkeit, die erworbenen Kenntnisse aus den Bereichen Design und Human Computer Interaction im Rahmen eines Projekts zur Anwendung zu bringen. Die Ausarbeitung des Projekts erfolgt in Kleingruppen. Aufgabe ist es, ein detailliertes Designkonzept (Konzeptpapier/Abstract, interaktiver Prototyp und/oder Video) in einem iterativen User Centered Design Prozess selbständig zu gestalten und entwickeln. Regelmäßige Workshops während des Semesters bilden den Rahmen für Diskussion und Feedback.</p>",
            "en": "<p>This course is an adjunct to the course VU Interface &amp; Interaction Design (183.289) and provides the opportunity to apply the acquired foundational knowledge in the areas of design and human computer interaction in a practical design project. The elaboration is done in small groups. The assignment is to develop a detailed design concept (consisting of a paper, interactive prototype and/or video) in a user centered design process. Regularly scheduled workshops throughout the course provide an opportunity for discussion and feedback.</p>"
        },
        "additionalInformation": {
            "de": null,
            "en": null
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Immanente Beurteilung des Projektfortschritts und Ergebnisses</p>",
            "en": "<p>Based on project progress and results</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1709493",
                "2783893",
                "2279605"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=194051&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=194051-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "194052",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Pragmatische Werkzeuge für modernes Projektmanagement für Ingenieure",
            "en": "State-of-the-Art Engineering Project Management via Adjusted Pragmatic Tool-Sets"
        },
        "objective": {
            "de": "<p>Befähigung zur selbständigen Evaluierung und Verwendung von innovativen Projektmanagement-Tools, ihre Möglichkeiten, Limitierungen und das Mapping in die tägliche reale Arbeit im Projekt.</p>",
            "en": "<p>todo</p>"
        },
        "teachingContent": {
            "de": "<p>In 3 interaktiven Workshops begleitet durch Übungen wird Projektmanagement und im speziellen der Tool-Einsatz im Kontext Software Engineering beleuchtet.<br>Wir gehen den Fragen nach: Was benötigt ein Projektmanager, welche Anwendungen &amp; Tools gibt es am Markt, was funktioniert im täglichen Einsatz und was nicht.<br>Dabei bewegen wir uns zwischen Theorie und gelebter Praxis.</p>",
            "en": "<p>In three interactive workshops accompanied by exercises, project management and in particular the use of tools in the context of software engineering will be highlighted.<br>We answer the questions: What does a project manager need, what applications &amp; tools are available on the market, what works in daily use and what doesn't.<br>We move between theory and practice.</p>"
        },
        "additionalInformation": {
            "de": "<p><strong>AKTUELLE INFORMATIONEN:</strong><br><span>Entsprechend des Maßnahmenkatalogs der Regierung ist die Präsenzlehre ab Mi, den 11.03. auszusetzen. Bitte melden Sie sich zur LVA hier in TISS an, damit wir Ihre Kontaktdaten haben</span><br><span>und Ihnen die Unterlagen zukommen lassen können. Sie können auch gerne eine mail an&nbsp;</span><a rel=\"nofollow\">care4u@inso.tuwien.ac.at</a><span>&nbsp;schicken, damit wir Sie auf die Vormerkliste nehmen und über die geeignete Informationsübermittlung informieren können.</span></p> \n<p>Bei Fragen wenden Sie sich bitte an <a href=\"mailto:care4u@inso.tuwien.ac.at\" rel=\"nofollow\">care4u@inso.tuwien.ac.at</a>.</p>",
            "en": "<p><span><strong>CURRENT INFORMATION:</strong><br><span>According to the government's catalogue of measures, classroom teaching is to be suspended from Wednesday 11 March. Please register for the LVA here in TISS, so that we have your contact details</span><br><span>and send you the documents. You are also welcome to send an e-mail to care4u@inso.tuwien.ac.at so that we can inform you about the appropriate information transfer.</span></span></p> \n<p><span>If you have any questions, please contact </span><a href=\"mailto:care4@inso.tuwien.ac.at\" rel=\"nofollow\">care4u@inso.tuwien.ac.at</a><span>.</span></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p><span>Erstellung, Abgabe und Durchführung von Präsentationen zur Projektmanagement-Toolevaluierung und zum Praxisprojekt, Abschlusspräsentation zur LV</span></p>",
            "en": "<p><span>Creation, submission, and execution of presentations on the project management tool evaluation and practical project, final presentation of the course</span></p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1709493",
                "5807977"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=194052&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=194052-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "194053",
        "semesterCode": "2020S",
        "courseType": "PR",
        "title": {
            "de": "Project in Computer Science 1",
            "en": "Project in Computer Science 1"
        },
        "objective": {
            "de": "<p><span>Ziel dieser Lehrveranstaltung ist die praktische Anwendung von Forschungsschwerpunkten aus Software Engineering and Internet Computing.&nbsp;</span><br><span>Dabei soll ein mittelgroßes Softwareprojekt mit State of the Art Technologien und Methoden implementiert werden.</span></p>",
            "en": "<p><span>The goal of this course is the practical application of research topics in Software Engineering and Internet Computing.&nbsp;</span><br><span>A mid-sized software project should be implemented with state of the art technology and methods.</span></p>"
        },
        "teachingContent": {
            "de": "<p><span>Bearbeitung eines größeren Projektes von der Konzeption bis zur praktischen Umsetzung, einzeln oder in einer Gruppe.&nbsp;</span><span>Die Studierenden verbessern ihre Fähigkeiten zur Kommunikation und Präsentation. Sie lernen aufbauend auf&nbsp;bekannten Methoden neue zu entwickeln und die Tragweite von fachlichen Entscheidungen einzuschätzen.</span></p>",
            "en": "<p>Working on a larger project from conception to practical implementation, individually or in a group. Students improve their communication and presentation skills. They learn to develop new methods based on familiar ones and to assess the consequences of professional decisions.</p>"
        },
        "additionalInformation": {
            "de": "<p><span><strong>AKTUELLE INFORMATIONEN:</strong><br><span>Entsprechend des Maßnahmenkatalogs der Regierung ist die Präsenzlehre ab Mi, den 11.03. auszusetzen. Bitte melden Sie sich zur LVA hier in TISS an, damit wir Ihre Kontaktdaten haben</span><br><span>und Ihnen die Unterlagen zukommen lassen können. Sie können auch gerne eine mail an&nbsp;</span><a rel=\"nofollow\">care4u@inso.tuwien.ac.at</a><span>&nbsp;schicken, damit wir Sie auf die Vormerkliste nehmen und über die geeignete Informationsübermittlung informieren können.</span></span></p> \n<p><span>Themenvorschläge finden Sie bei unseren Forschungsgruppen unter&nbsp;</span><a href=\"https://www.inso.tuwien.ac.at/#research\" rel=\"nofollow\">https://www.inso.tuwien.ac.at/#research</a><span>. Sie können entweder direkt den jeweiligen Betreuer kontaktieren oder zu unserer Vorbesprechung kommen! Allgemeine Anfragen richten Sie bitte an </span><a href=\"mailto:care4u@inso.tuwien.ac.at\" rel=\"nofollow\"><u>care4u@inso.tuwien.ac.at</u><span>.</span></a><br><br><strong>Aufwandsschätzung (ECTS-Breakdown):</strong><br><span>Vorbesprechung: 1 h</span><br><span>Recherchetätigkeiten: 18 h</span><br><span>Projektdurchführung: 110 h</span><br><span>Vorbereitung der Präsentation: 10 h</span><br><span>Präsentation: 1 h</span><br><span>Besprechungen: 10 h</span><br><span>---------------------------------------------------&nbsp;</span><br><strong>Summe: 150 Stunden (6 ECTS)</strong></p>",
            "en": "<p><span><strong>CURRENT INFORMATION:</strong><br><span>According to the government's catalogue of measures, classroom teaching is to be suspended from Wednesday 11 March. Please register for the LVA here in TISS, so that we have your contact details</span><br><span>and send you the documents. You are also welcome to send an e-mail to care4u@inso.tuwien.ac.at so that we can inform you about the appropriate information transfer.</span></span></p> \n<p><span>Topics for the course can be found on the websites of our research groups (</span><a href=\"https://www.inso.tuwien.ac.at/#research\" rel=\"nofollow\">https://www.inso.tuwien.ac.at/#research</a><span>). You can contact the advisor directly or you can come to our preliminary talk. If you have any questions, please contact </span><a href=\"mailto:care4u@inso.tuwien.ac.at\" rel=\"nofollow\">care4u@inso.tuwien.ac.at</a><span>.&nbsp;</span><br><br><strong>Effort for the student (ECTS-Breakdown):</strong><br><span>Preliminary Talk: 1 h</span><br><span>Initial research: 18 h</span><br><span>Project Implementation: 110 h</span><br><span>Preparing Presentation: 10 h</span><br><span>Presentation: 1 h</span><br><span>Meetings: 10 h</span><br><span>---------------------------------------------------&nbsp;</span><br><strong>Sum: 150 hours (6 ECTS)</strong></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>LV-Immanente Leistungsbeurteilung (Präsentationen, Zwischenabgaben) und Qualität des fertigen Projektes, sowohl praktisch als auch hinsichtlich der Dokumentation</p>",
            "en": "<p>Course immanent assessment (presentations, deliverables) and quality of the finished project, both practical and documentation</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "4.0",
        "lecturers": {
            "oid": [
                "1709493",
                "2283789"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=194053&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=194053-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "194054",
        "semesterCode": "2020S",
        "courseType": "PR",
        "title": {
            "de": "Project in Computer Science 2",
            "en": "Project in Computer Science 2"
        },
        "objective": {
            "de": "<p>Ziel dieser Lehrveranstaltung ist die praktische Anwendung von Forschungsschwerpunkten aus Software Engineering and Internet Computing.&nbsp;<br>Dabei soll ein mittelgroßes Softwareprojekt mit State of the Art Technologien und Methoden implementiert werden.</p>",
            "en": "<p>The goal of this course is the practical application of research topics in Software Engineering and Internet Computing.&nbsp;<br>A mid-sized software project should be implemented with state of the art technology and methods.</p>"
        },
        "teachingContent": {
            "de": "<p>Bearbeitung eines größeren Projektes von der Konzeption bis zur praktischen Umsetzung, einzeln oder in einer Gruppe.&nbsp;Die Studierenden verbessern ihre Fähigkeiten zur Kommunikation und Präsentation. Sie lernen aufbauend auf&nbsp;bekannten Methoden neue zu entwickeln und die Tragweite von fachlichen Entscheidungen einzuschätzen.&nbsp;</p>",
            "en": "<p>Working on a larger project from conception to practical implementation, individually or in a group. Students improve their communication and presentation skills. They learn to develop new methods based on familiar ones and to assess the consequences of professional decisions.</p>"
        },
        "additionalInformation": {
            "de": "<p><strong>AKTUELLE INFORMATIONEN:</strong><br><span>Entsprechend des Maßnahmenkatalogs der Regierung ist die Präsenzlehre ab Mi, den 11.03. auszusetzen. Bitte melden Sie sich zur LVA hier in TISS an, damit wir Ihre Kontaktdaten haben</span><br><span>und Ihnen die Unterlagen zukommen lassen können. Sie können auch gerne eine mail an&nbsp;</span><a rel=\"nofollow\">care4u@inso.tuwien.ac.at</a><span>&nbsp;schicken, damit wir Sie auf die Vormerkliste nehmen und über die geeignete Informationsübermittlung informieren können.</span></p> \n<p>Themenvorschläge finden Sie bei unseren Forschungsgruppen unter&nbsp;<a href=\"https://www.inso.tuwien.ac.at/#research\" rel=\"nofollow\">https://www.inso.tuwien.ac.at/#research</a>. Sie können entweder direkt den jeweiligen Betreuer kontaktieren oder zu unserer Vorbesprechung kommen! Allgemeine Anfragen richten Sie bitte an <a href=\"mailto:care4u@inso.tuwien.ac.at\" rel=\"nofollow\"><u>care4u@inso.tuwien.ac.at</u></a>.<br><br><strong>Aufwandsschätzung (ECTS-Breakdown):</strong><br>Vorbesprechung: 1 h<br>Recherchetätigkeiten: 18 h<br>Projektdurchführung: 110 h<br>Vorbereitung der Präsentation: 10 h<br>Präsentation: 1 h<br>Besprechungen: 10 h<br>---------------------------------------------------&nbsp;<br><strong>Summe: 150 Stunden (6 ECTS)</strong></p>",
            "en": "<p><strong>CURRENT INFORMATION:</strong><br><span>According to the government's catalogue of measures, classroom teaching is to be suspended from Wednesday 11 March. Please register for the LVA here in TISS, so that we have your contact details</span><br><span>and send you the documents. You are also welcome to send an e-mail to care4u@inso.tuwien.ac.at so that we can inform you about the appropriate information transfer.</span></p> \n<p>Topics for the course can be found on the websites of our research groups (<a href=\"https://www.inso.tuwien.ac.at/#research\" rel=\"nofollow\">https://www.inso.tuwien.ac.at/#research</a>). You can contact the advisor directly or you can come to our preliminary talk. If you have any questions, please contact <a href=\"mailto:care4u@inso.tuwien.ac.at\" rel=\"nofollow\"><u>care4u@inso.tuwien.ac.at</u></a>.&nbsp;<br><br><strong>Effort for the student (ECTS-Breakdown):</strong><br>Preliminary Talk: 1 h<br>Initial research: 18 h<br>Project Implementation: 110 h<br>Preparing Presentation: 10 h<br>Presentation: 1 h<br>Meetings: 10 h<br>---------------------------------------------------&nbsp;<br><strong>Sum: 150 hours (6 ECTS)</strong></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>LV-Immanente Leistungsbeurteilung (Präsentationen, Zwischenabgaben) und Qualität des fertigen Projektes, sowohl praktisch als auch hinsichtlich der Dokumentation</p>",
            "en": "<p>Course immanent assessment (presentations, deliverables) and quality of the finished project, both practical and documentation</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "4.0",
        "lecturers": {
            "oid": [
                "1709493",
                "2283789"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=194054&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=194054-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "194065",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Ausgewählte Kapitel digitaler Forensik I",
            "en": "Selected Topics of Digital Forensics I"
        },
        "objective": {
            "de": "<p><span>Die Lehrveranstaltung vermittelt ausgewählte Aspekte der digitalen&nbsp;</span><span>Forensik. Aufbauend auf forensischen wie rechtlichen Grundlagen werden&nbsp;</span><span>unterschiedliche Anwendungsgebiete und Methoden der digitalen Forensik&nbsp;</span><span>vorgestellt und diskutiert. Um die Anwendbarkeit und Herausforderungen&nbsp;</span><span>in der Praxis zu zeigen, werden auch externe Gast-Vortragende aus der</span><br><span>Wirtschaft eingeladen. Im Übungsteil, der v.a. in Teams erfolgt,&nbsp;</span><span>werden die Inhalte der Vorlesung erweitert und vertieft.</span><br><br><span>AbsolventInnen der Lehrveranstaltung sollen ein grundlegendes&nbsp;</span><span>Verständnis von digitaler Forensik erreichen, verstehen, welche Aspekte&nbsp;</span><span>bei digitaler Forensik kritisch sind und einen Einblick in die&nbsp;</span><span>Anwendung digitaler Forensik erhalten.</span></p>",
            "en": "<p><span>The lecture imparts selected topics of digital forensics. Based on&nbsp;</span><span>forensic and legal fundamentals, different fields of application and&nbsp;</span><span>methods of digital forensic are introduced and discussed. In order to&nbsp;</span><span>demonstrate the applicability and challenges of digital forensics in</span><br><span>the field, external guest lecturers from industry are invited. In the&nbsp;</span><span>exercises which are largely accomplished in teams, students extend&nbsp;</span><span>and deepen knowlegde of the lecture.</span><br><br><span>Graduates of the course have a fundamental understanding of digital&nbsp;</span><span>forensics, know critical aspects of it and have an insight in the&nbsp;</span><span>applicability of digital forensics.</span></p>"
        },
        "teachingContent": {
            "de": "<p><span>Grundlagen der digitalen Forensik, rechtliche Aspekte der digitalen&nbsp;</span><span>Forensik, Fingerprinting von Soft- und Hardware, Forensik in&nbsp;</span><span>unterschiedlichen Anwendungsgebieten (z.B. Memory und Storage Dumps,&nbsp;</span><span>Bilder und Videos), Forensik bei Payment-Systemen.</span></p>",
            "en": "<p><span>Foundations of digital forensics, legal aspects of digital forensics,&nbsp;</span><span>fingerprinting of software and hardware, forensic in different&nbsp;</span><span>application fields (e.g., memory and storage dumps, images and</span><br><span>videos), forensics in payment systems.</span></p>"
        },
        "additionalInformation": {
            "de": "<p><strong>ECTS-Breakdown</strong><br><br><span>* Vorbesprechung: 1h</span><br><span>* Vorlesungen: 12h</span><br><span>* Self Study (Uebungen, Testvorbereitung): 60.5h</span><br><span>* Schriftlicher Test: 1.5h</span></p>",
            "en": "<p><strong>ECTS-Breakdown</strong><br><br>* Preliminary talk: 1h<br>* Lectures: 12h<br>* Self Study (Exercises, Preparation Time for Written Exam): 60.5h<br>* Written Exam: 1.5h</p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Es gibt einen Vorlesungsteil und einen Übungsteil. Beide müssen positiv absolviert werden.</p>",
            "en": "<p>There is a lecture part and an exercise part. Both must be completed positively.</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            },
            "precedingCourses": {
                "course": [
                    "183594",
                    "183637"
                ]
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1709493",
                "2510317"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://security.inso.tuwien.ac.at/selected-topics-digital-forensics-i-ss2020/",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=194065-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "194066",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Optimierung von Legacy-Systemen - Lernen aus der Geschichte großer IT-Systeme und ihrer (Nicht-)Ablöse",
            "en": "Optimizing large IT Legacy - Learning from (still) operative Old IT-Systems and their (non-)replacement"
        },
        "objective": {
            "de": "<p>Weltweit werden jede Sekunde 1,1 Mio. COBOL Transaktionen pro Sekunde durchgeführt - aber nur 50.000 Google-Suchanfragen. Wesentliche Bereiche der modernen Gesellschaft, wie z.B. Aktienhandel, Banktransaktionen, Melderegister oder Steuerberechnung, werden mehrheitlich von Legacy-Systemen realisiert, die das Daten- und Funktionsfundament moderner Web-basierter Systeme darstellen. Diese COBOL, PL/I und RPG basierten Legacy-Systeme müssen noch über Jahrzehnte gewartet, erweitert und in neue moderne Anwendungsarchitekturen integriert werden. &nbsp;<br>Lernen Sie in dieser Lehrveranstaltung Legacy-Technologien und ihre Spezifika kennen - aber lernen Sie darüber hinaus auch, welche Aspekte moderne Systemen mit Legacy-Systemen teilen. Vermittelt wird anhand von realen Projekt-Beispielen, wie Legacy-System-Modernization in der industriellen Praxis erfolgt - von der Strategiefindung bis zu ganz konkreten technischen Aspekten wie Codepage-Migration, Buffer-Overflows und Grundproblemen der Cost-based Optimization in relationalen Datenbanken. &nbsp;<br>Darüber hinaus ist ein heute entwickeltes Softwaresystem jedenfalls auch ein in Zukunft zu wartendes und irgendwann abzulösendes Legacy-System - diese Lehrveranstaltung hilft Ihnen, etwaige Technologiesünden in eigenen Projekten zu vermeiden sowie auch die Historie hinter, manchmal nur scheinbar, neuen Konzepten der Software-Entwicklung besser zu verstehen.</p> \n<p>Konkret beispielsweise auf Basis der Historie von Optimierungsstrategien&nbsp;für Abfragen relationaler Datenbanken. Eine relationale Abfragesprache wie SQL definiert nur, welche Daten im Resultat sein sollen, nicht aber, wie diese Daten am effizientesten zu ermitteln sind.&nbsp;Wie die Daten von der Datenbank gelesen, verknüpft und berechnet werden, wird im execution plan beschrieben. Das Ermitteln des möglichst besten execution planes ist&nbsp;Aufgabe des Optimizers. In aktuellen relationalen Datenbanken wird heute praktisch ausschließlich die cost based optimization verwendet. Dabei werden aus statistischen Informationen über die Daten Zugriffskosten berechnet. Der kostengünstigste Zugriffsplan wird dann gewählt. Diese cost based optimization hat jedoch ungelöste Schwächen und Spezialfälle, die anhand der verbreitesten kommerziellen relationalen Datenbank Oracle betrachtet werden.&nbsp;</p>",
            "en": "<p>tbd</p>"
        },
        "teachingContent": {
            "de": "<p>Die Vorlesung beschäftigt sich u.a. mit folgenden Aspekten der Legacy-System-Modernization: &nbsp;</p> \n<p>- Grundlagen und Strategie der Legacy-System-Modernization <br>- Geschichte heutiger Legacy-Systeme (Mainframe, Midrange) <br>- Wesentliche Legacy-Technologien (COBOL, PL/I, Transaktionsmonitor/CICS, Terminal, Sequentielle Dateien, Relationale Datenbanken) <br>- Integration von Legacy-Technologien in moderne Service-orientierte Architekturen <br>- Tuning, insbesondere am Beispiel relationaler Datenbanken (z.B. Grundprobleme der Cost based Optimization in relationalen Datenbanken) &nbsp;</p> \n<p><strong>Didaktisches Vorgehen:</strong>&nbsp; In der Vorlesung werden die erforderlichen Fachgrundlagen vermittelt, es erfolgt eine Anleitung zur weiterführenden Recherche bei Vertiefungsbedarf und die Vorstellung von realen, großen Fallbeispielen.</p>",
            "en": "<p>The lecture deals with the following aspects of legacy system modernization:</p> \n<p>- Basics and Strategy of Legacy System Modernization <br>- History of today's legacy systems (mainframe, midrange) <br>- Essential legacy technologies (COBOL, PL/I, Transaction Monitor/CICS, Terminal, Sequential files, Relational databases) <br>- Integration of legacy technologies into modern service-oriented architectures <br>- Tuning, especially using the example of relational databases (e.g. basic problems of cost based optimization in relational databases)</p> \n<p>Didactical procedure: In the lecture, the necessary basic knowledge is imparted, instructions for further research in case of need for more in-depth study and the presentation of real, large case studies are given.</p>"
        },
        "additionalInformation": {
            "de": "<p><strong>AKTUELLE INFORMATIONEN:</strong><br><span>Entsprechend des Maßnahmenkatalogs der Regierung ist die Präsenzlehre ab Mi, den 11.03. auszusetzen. Bitte melden Sie sich zur LVA hier in TISS an, damit wir Ihre Kontaktdaten haben</span><br><span>und Ihnen die Unterlagen zukommen lassen können. Sie können auch gerne eine mail an&nbsp;</span><a rel=\"nofollow\">care4u@inso.tuwien.ac.at</a><span>&nbsp;schicken, damit wir Sie auf die Vormerkliste nehmen und über die geeignete Informationsübermittlung informieren können.</span></p> \n<p>Anwesenheitspflicht</p>",
            "en": "<p><strong>CURRENT INFORMATION:</strong><br><span>According to the government's catalogue of measures, classroom teaching is to be suspended from Wednesday 11 March. Please register for the LVA here in TISS, so that we have your contact details</span><br><span>and send you the documents. You are also welcome to send an e-mail to care4u@inso.tuwien.ac.at so that we can inform you about the appropriate information transfer.</span></p> \n<p>Attendance is compulsory</p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Anwesenheitspflicht bei den Blockvorlesungen. Die Benotung erfolgt basierend auf einer schriftlichen Übungsausarbeitung zum Prüfungstermin, wobei die Note durch aktive Mitarbeit in den Vorlesungsblöcken verbessert werden kann.</p>",
            "en": "<p>Obligatory attendance at block lectures. Grading is based on a written exercise on the examination date, whereby the grade can be improved by active participation in the lecture blocks.</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1709493",
                "15016133"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=194066&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=194066-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "194067",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Technical and Organizational Mechanisms of Payments",
            "en": "Technical and Organizational Mechanisms of Payments"
        },
        "objective": {
            "de": "<p><span>The aim of the lecture is to have a basic understanding of future technologies, but also organizational mechanics of money, banking and payment.</span></p>",
            "en": "<p><span>The aim of the lecture is to have a basic understanding of future technologies, but also organizational mechanics of money, banking and payment.</span></p>"
        },
        "teachingContent": {
            "de": "<p><span>Challenged by emergent disruptors money, banking and payment are in a rapid transition. Looking at the history and presence of money and payment, the lecture gives an introduction into the technological enablers and the future of banking, payment, and money. Giving informed insights into economics, technical and legal crunchpoints of current and future technologies, but also organizational mechanics of money, banking and payment, a basic understanding of the domain is taught. This is needed in order to be able to make informed decisions and to deepen the understanding of monetary systems in general.</span></p>",
            "en": "<p>Challenged by emergent disruptors money, banking and payment are in a rapid transition. Looking at the history and presence of money and payment, the lecture gives an introduction into the technological enablers and the future of banking, payment, and money. Giving informed insights into economics, technical and legal crunchpoints of current and future technologies, but also organizational mechanics of money, banking and payment, a basic understanding of the domain is taught. This is needed in order to be able to make informed decisions and to deepen the understanding of monetary systems in general.</p>"
        },
        "additionalInformation": {
            "de": "<p>Bei Fragen bitte an <a href=\"mailto:teaching@inso.tuwien.ac.at\" rel=\"nofollow\">teaching@inso.tuwien.ac.at</a>&nbsp;schreiben.</p>",
            "en": "<p>Bei Fragen bitte an&nbsp;<a href=\"mailto:teaching@inso.tuwien.ac.at\" rel=\"nofollow\">teaching@inso.tuwien.ac.at</a>&nbsp;schreiben.</p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>- Immanente Beurteilung der Teilnahme an der Lehrveranstaltung<br>-&nbsp;Präsentation des erlernten Wissens und Reflexion aktueller Themen und Technologien im Rahmen eines Vortrages oder schriftlichen Ausarbeitung.</p>",
            "en": "<ul> \n <li>Course Participation</li> \n <li>Presentation of the learned knowledge and reflection of current topics and technologies in the course of a graded presentation or paper</li> \n</ul>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1709493",
                "6421801"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=194067&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=194067-2019W",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "194081",
        "semesterCode": "2020S",
        "courseType": "PV",
        "title": {
            "de": "TechTalks - Industrielle digitale Technologien Stand 2020",
            "en": "TechTalks - Industrial Digital Technologies Status 2020"
        },
        "objective": {
            "de": null,
            "en": null
        },
        "teachingContent": {
            "de": "<p>Präsentation neuester Forschungsarbeiten auf dem Gebiet der Informatik, aktuelle Vorträge zum State-of-the-Art in unterschiedlichen Themenbereichen.</p> \n<ul> \n <li><span>Freie Wahl von Themengebieten mit besonderem Schwerpunkt auf industrielle Relevanz</span></li> \n <li><span>Präsentation der Ergebnisse</span></li> \n <li><span>Diskussionsrunden nach Bedarf</span></li> \n</ul>",
            "en": "<p>Presentation of the latest research work in the field of computer science, current lectures on state-of-the-art in various subject areas.</p> \n<ul> \n <li><span>Free choice of topics with special emphasis on industrial relevance</span></li> \n <li><span>Presentation of the results</span></li> \n <li><span>Discussion rounds as required</span></li> \n</ul>"
        },
        "additionalInformation": {
            "de": "<p>Bei Fragen wenden Sie sich bitte an <a href=\"mailto:care4u@inso.tuwien.ac.at\" rel=\"nofollow\">INSO care4u</a>.</p>",
            "en": "<p>If you have any questions, please contact <a href=\"mailto:care4u@inso.tuwien.ac.at\" rel=\"nofollow\">INSO care4u</a>.</p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>LV-Immanente Leistungsbeurteilung (Präsentationen, Zwischenabgaben)</p> \n<p><strong>ECTS-Breakdown:</strong><br>Vorbesprechung: 2 h<br>Themenvorstellung/ -auswahl: 1 h<br>Vorbereitung: 47<br>Diskussionsrunden: 15 h<br>Präsentationen der Ergebnisse: 10 h</p>",
            "en": "<p>Immanent performance assessment (presentations, interim submissions)</p> \n<p><strong>ECTS-Breakdown:</strong><br>Preliminary discussion: 2 h<br>Topic presentation/ - selection: 1 h<br>Preparation: 47<br>Discussion rounds: 15 h<br>Presentations of the results: 10 h</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": "1709493"
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=194081&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "NONE",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=194081-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "194087",
        "semesterCode": "2020S",
        "courseType": "SE",
        "title": {
            "de": "Unkonventionelle IT (U.IT) zwischen (Kontroll-)Theorie, Neuralen Netzen, Quantenalgorithmen und -kryptographie",
            "en": "Unconventional Information Technology (U.IT), from Control Theory via Neural Networks to Quantum Algorithms and Cryptography: a Deep Dive"
        },
        "objective": {
            "de": null,
            "en": null
        },
        "teachingContent": {
            "de": "<p>In diesem Seminar beschäftigen wir uns mit aktuellen Forschungsthemen an der Schnittstelle von Informatik, maschinellem Lernen und Physik. Gemeinsam diskutieren und analysieren wir aktuelle Forschungsergebnisse, mit dem Ziel, ein tiefergehendes Verständnis einiger derzeit aufkommender Technologien aufzubauen. Für dieses Seminar gibt es keinen strengen Lehrplan; im Folgenden finden Sie eine Liste möglicher interessanter Themen.</p> \n<p>Folgende Themenschwerpunkte werden im Übungsteil behandelt:</p> \n<ul> \n <li>Theorie des Deep Learnings:<br>Trotz der großen jüngsten Erfolge des Deep Learnings ist das Verhalten von deep neural networks (DNNs) überraschend wenig verstanden, und in vielerlei Hinsicht bleiben DNNs eine Blackbox. Daher bleibt das Design neuer, auf spezifische Anwendungen zugeschnittener Netzwerkarchitekturen ein Ad-hoc-Prozess, und die Interpretation und Analyse von (falschen) Ergebnissen stellt eine schwierige Herausforderung dar. Einige der Ansätze zur Lösung dieses Problems sind: die Beschreibung von DNNs aus der Sicht dynamischer Systeme und der Kontrolltheorie [1] und Analysen auf der Grundlage einer mean-field Beschreibung [2, 3]. Letzteres erlaubt beispielsweise Aussagen über die Aussagekraft und Trainierbarkeit bestimmter Netzwerkarchitekturen und offenbart spannende Zusammenhänge zur statistischen Physik.</li> \n</ul> \n<ul> \n <li>Hybride Modellierungstechniken:<br>Obwohl es den Anschein hat, dass DNNs so entworfen und trainiert werden können, dass sie fast jedes System beschreiben, vernachlässigen naive Ansätze mögliches Vorwissen über die Funktionsweise des modellierten Systems. Vorhandenes Domänenwissen (z.B. physikalische Gesetze, die die zeitliche Entwicklung eines dynamischen Systems beschreiben) kann jedoch genutzt werden, um den zulässigen Lösungsraum zu begrenzen, was zu einer Reduktion der erforderlichen Trainingsdaten und zu einer erhöhten Vorhersagegenauigkeit führt. In Kombination mit klassischen numerischen Techniken können DNNs z. B. verwendet werden um datengetriebene Lösungen von Differentialgleichungen [4] zu finden oder um die unterliegenden Gleichungen selbst anhand der Daten zu bestimmen [5].</li> \n</ul> \n<ul> \n <li>Quantum Computing und (Post-)Quantenkryptographie:<br>Während die ersten voll funktionsfähigen (wenn auch kleinen) Quantenprozessoren erscheinen [6], identifizieren Forscher eine wachsende Zahl von Anwendungen, die durch den Einsatz von Quantenalgorithmen potenziell beschleunigt werden können, darunter auch viele Algorithmen aus dem Bereich des maschinellen Lernens [7]. Ein weiteres aktives Forschungsfeld ist das Auffinden so genannter quantenresistenter kryptographischer Algorithmen, die mit Shors Algorithmus nicht zu knacken sind.</li> \n</ul> \n<p>Um das Seminar zugänglicher zu machen, planen wir einführende Einheiten zu den weniger bekannten Themen (z.B. Quantencomputer) zu halten. Allerdings sind einige Kenntnisse in höherer Mathematik (z.B. lineare Algebra, Wahrscheinlichkeitstheorie, Grundlagen der Analysis) erforderlich.</p> \n<ol> \n <li>Liu, Guan-Horng, and Evangelos A. Theodorou. ArXiv:1908.10920 [Cs, Eess, Stat], September 28, 2019<a href=\"http://arxiv.org/abs/1908.10920\" rel=\"nofollow\">. http://arxiv.org/abs/1908.10920</a>.</li> \n <li>Raghu, Maithra, Ben Poole, Jon Kleinberg, Surya Ganguli, and Jascha Sohl- Dickstein. arXiv:1606.05336 [Cs, Stat], June 18, 2017. <a href=\"http://arxiv.org/abs/1606.05336\" rel=\"nofollow\">http://arxiv.org/abs/1606.05336</a>.</li> \n <li>Schoenholz, Samuel S., Justin Gilmer, Surya Ganguli, and Jascha Sohl-Dickstein. arXiv:1611.01232 [Cs, Stat], April 4, 2017<a href=\"http://arxiv.org/abs/1611.01232\" rel=\"nofollow\">. http://arxiv.org/abs/1611.01232</a>.</li> \n <li>Raissi, Maziar, Paris Perdikaris, and George Em Karniadakis. arXiv:1711.10561 [Cs, Math, Stat], November 17, 2017<a href=\"http://arxiv.org/abs/1711.10561\" rel=\"nofollow\">. http://arxiv.org/abs/1711.10561</a>.</li> \n <li>Raissi, Maziar, Paris Perdikaris, and George Em Karniadakis. arXiv:1711.10566 [Cs, Math, Stat], November 28, 2017<a href=\"http://arxiv.org/abs/1711.10566\" rel=\"nofollow\">. http://arxiv.org/abs/1711.10566</a>.</li> \n <li>Arute, Frank, Kunal Arya, Ryan Babbush, et al. Nature 574, no. 7779 (October 2019): 505–10. <a href=\"https://doi.org/10.1038/s41586-019-1666-5\" rel=\"nofollow\">https://doi.org/10.1038/s41586-019-1666-5</a>.</li> \n <li>Schuld, M., I. Sinayskiy, and F. Petruccione. arXiv:1409.3097 [quant-ph], September 10, 2014. <a href=\"https://arxiv.org/abs/1409.3097\" rel=\"nofollow\">https://arxiv.org/abs/1409.3097</a></li> \n</ol>",
            "en": "<p>In this seminar, we will explore cutting-edge research topics at the intersection of computer science, machine learning and physics. Together we will discuss and analyze papers with the aim to build an understanding beyond the level of mere applications of some currently emerging technologies. For this seminar there is no strict syllabus; the following is a list of possible interesting topics.</p> \n<p>The following topics are subject of this course:</p> \n<ul> \n <li><em>Theory of deep learning<br></em>Despite the huge recent success of deep learning, the behavior of deep neural networks (DNNs) is surprisingly poorly understood, and in many ways DNNs remain a black box. As a consequence, the design of new network architectures tailored to specific applications remains an ad-hoc process, and interpretation and analysis of (incorrect) results proves challenging. Some of the approaches to tackle this problem are: describing DNNs from the point of view of dynamical systems and control theory [1], and analyses based on mean-field theory [2, 3]. The latter approach allows, for example, for statements about the expressiveness and trainability of certain network architectures, and reveals intriguing connections to statistical physics.</li> \n</ul> \n<ul> \n <li><em>Hybrid modelling techniques<br></em>Although it seems that DNNs can be tailored to describe almost any system given enough training data, naive approaches typically neglect prior knowledge about the inner workings of the modeled system. Existing domain knowledge (e.g., physical laws describing the time evolution of a dynamical system) can, however, be used to constrain the admissible solution space, leading to a decrease in required training data and to increased predictive accuracy. In combination with classical numerical techniques DNNs can be used to find data-driven solutions of differential equations [4] or for data-driven discovery of the governing equations themselves [5].</li> \n</ul> \n<ul> \n <li><em>Quantum computing and (post-) quantum cryptography<br></em>As the first fully functional (however small) quantum processors are starting to appear [6], researchers are discovering an increasing number of applications that are potentially susceptive to a quantum speed-up, including many machine-learning algorithms [7]. Another active research field triggered by the advent of quantum computing is finding so-called quantum-resistant cryptographic algorithms, which cannot be broken by Shor’s algorithm.</li> \n</ul> \n<p>In order to make the seminar more accessible we intend to have introductory sessions on the less well-known topics (e.g., quantum computing). However, some background in higher mathematics (e.g., linear algebra, probability theory, basic calculus) will be required.</p> \n<ol> \n <li>Liu, Guan-Horng, and Evangelos A. Theodorou. <em>ArXiv:1908.10920 [Cs, Eess, Stat]</em>, September 28, 2019. <u><a href=\"http://arxiv.org/abs/1908.10920\" rel=\"nofollow\">http://arxiv.org/abs/1908.10920</a></u>.</li> \n <li>Raghu, Maithra, Ben Poole, Jon Kleinberg, Surya Ganguli, and Jascha Sohl- Dickstein. <em>arXiv:1606.05336 [Cs, Stat]</em>, June 18, 2017.<u> <a href=\"http://arxiv.org/abs/1606.05336\" rel=\"nofollow\">http://arxiv.org/abs/1606.05336</a></u>.</li> \n <li>Schoenholz, Samuel S., Justin Gilmer, Surya Ganguli, and Jascha Sohl-Dickstein.<em>arXiv:1611.01232 [Cs, Stat]</em><span>, April 4, 2017.&nbsp;</span><u><a href=\"http://arxiv.org/abs/1611.01232\" rel=\"nofollow\">http://arxiv.org/abs/1611.01232</a></u><span>.</span></li> \n <li><span>Raissi, Maziar, Paris Perdikaris, and George Em Karniadakis. </span><em>arXiv:1711.10566 [Cs, Math, Stat]</em><span>, November 28, 2017</span><a href=\"http://arxiv.org/abs/1711.10566\" rel=\"nofollow\">.</a><u><a href=\"http://arxiv.org/abs/1711.10566\" rel=\"nofollow\">http://arxiv.org/abs/1711.10566</a></u><span>.</span>Raissi, Maziar, Paris Perdikaris, and George Em Karniadakis. <em>arXiv:1711.10561 [Cs, Math, Stat]</em>, November 17, 2017<a href=\"http://arxiv.org/abs/1711.10561\" rel=\"nofollow\">.</a><u><a href=\"http://arxiv.org/abs/1711.10561\" rel=\"nofollow\">http://arxiv.org/abs/1711.10561</a></u>.</li> \n <li>Arute, Frank, Kunal Arya, Ryan Babbush, et al. <em>Nature </em>574, no. 7779 (October 2019): 505–10. <u><a href=\"https://doi.org/10.1038/s41586-019-1666-5\" rel=\"nofollow\">https://doi.org/10.1038/s41586-019-1666-5</a></u>.</li> \n <li>Schuld, M., I. Sinayskiy, and F. Petruccione. <em>arXiv:1409.3097 [quant-ph], </em>September 10, 2014. <u><a href=\"https://arxiv.org/abs/1409.3097\" rel=\"nofollow\">https://arxiv.org/abs/1409.3097</a></u></li> \n</ol>"
        },
        "additionalInformation": {
            "de": "<p>Allgemeine Anfragen richten Sie bitte an <a href=\"mailto:care4u@tuwien.ac.at\" rel=\"nofollow\">care4u@inso.tuwien.ac.at</a>.</p> \n<p><br>Beachten Sie beim Verfassen der Ausarbeitung bitte die Richtlinie der TU Wien zum Umgang mit Plagiaten: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf</a></p>",
            "en": "<p>If you have any questions, please contact <a href=\"mailto:care4u@tuwien.ac.at\" rel=\"nofollow\">care4u@inso.tuwien.ac.at</a>.</p> \n<p><br>Please consider the plagiarism guidelines of TU Wien when writing your seminar paper: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf</a></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Die Bewertung ergibt sich aus der&nbsp;<span>aktiven Teilnahme durch eine Präsentation zu einem ausgewählten Thema/zu einer ausgewählten Publikation.</span>&nbsp;</p>",
            "en": "<p>The evaluation results from the a<span>ctive participation by giving a presentation about a chosen topic/publication.</span></p>"
        },
        "related": {
            "recommendation": {
                "de": "<p>Kenntnisse in höherer Mathematik (z.B. lineare Algebra, Wahrscheinlichkeitstheorie, Grundlagen der Analysis) sind erforderlich.</p>",
                "en": "<p>Background knowledge in higher mathematics (e.g., linear algebra, probability theory, basic calculus) will be required.</p> \n<p>&nbsp;</p>"
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "1709493",
                "22605333"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=194087&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=194087-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "180772",
        "semesterCode": "2020S",
        "courseType": "SE",
        "title": {
            "de": "Seminar für Diplomand_innen für Data Science",
            "en": "Seminar for Master Students in Data Science"
        },
        "objective": {
            "de": "<p>-</p>",
            "en": "<p>-</p>"
        },
        "teachingContent": {
            "de": "<p>Dieses Seminar ist Pflicht für alle Studierenden des Master Data Science.</p> \n<p>Vorträge der DiplomandInnen über Proposal und Ergebnisse ihrer Diplomarbeiten.</p>",
            "en": "<p>This seminar is mandatory for all students of the Master Data Science.</p> \n<p>Presentations of master thesis proposal and final results of the master thesis.</p>"
        },
        "additionalInformation": {
            "de": "<p>Beachten Sie beim Verfassen der Ausarbeitung bitte die Richtlinie der TU Wien zum Umgang mit Plagiaten: <a href=\"https://www.tuwien.ac.at/fileadmin/t/ukanzlei/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf\" rel=\"nofollow\">https://www.tuwien.ac.at/fileadmin/t/ukanzlei/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf</a></p> \n<p><br>Beachten Sie beim Verfassen der Ausarbeitung bitte die Richtlinie der TU Wien zum Umgang mit Plagiaten: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf</a></p>",
            "en": "<p>Please consider the plagiarism guidelines of TU Wien when writing your seminar paper: <a href=\"http://www.tuwien.ac.at/fileadmin/t/ukanzlei/t-ukanzlei-english/Plagiarism.pdf\" rel=\"nofollow\">http://www.tuwien.ac.at/fileadmin/t/ukanzlei/t-ukanzlei-english/Plagiarism.pdf</a></p> \n<p><br>Please consider the plagiarism guidelines of TU Wien when writing your seminar paper: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf</a></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Bewertung der beiden Präsentationen und des Reviews.</p>",
            "en": "<p>Assessment&nbsp; of both presentations and of the review.</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "1.0",
        "lecturers": {
            "oid": [
                "3365713",
                "2152749"
            ]
        },
        "tutors": null,
        "instituteCode": "E180",
        "instituteName": {
            "de": "Fakultät für Informatik",
            "en": "Faculty of Informatics"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=180772&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "NONE",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=180772-2020S",
        "language": {
            "de": "Englisch",
            "en": "English"
        }
    },
    {
        "courseNumber": "194078",
        "semesterCode": "2020S",
        "courseType": "SE",
        "title": {
            "de": "Research Methods",
            "en": "Research Methods"
        },
        "objective": {
            "de": null,
            "en": null
        },
        "teachingContent": {
            "de": "<p>Einführung in das interdisziplinäre Forschungsgebiet der Wirtschaftsinformatik</p> \n<ul> \n <li>gestaltungsorientierte Methoden</li> \n <li>empirisch-quantitative Methoden&nbsp;</li> \n <li>empirisch-qualitative Methoden</li> \n <li>Daten-getriebene Methoden</li> \n <li>formal-analytische Methoden</li> \n</ul>",
            "en": "<p>Introduction to the interdisciplinary research field of business informatics</p> \n<ul> \n <li>design-based methods</li> \n <li>empirical-quantitative methods</li> \n <li>empirical-qualitative methods</li> \n <li>data-driven methods</li> \n <li>formal-analytical methods</li> \n</ul>"
        },
        "additionalInformation": {
            "de": "<p>Beachten Sie beim Verfassen der Ausarbeitung bitte die Richtlinie der TU Wien zum Umgang mit Plagiaten: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Lehre_-_Leitfaden_zum_Umgang_mit_Plagiaten.pdf</a></p>",
            "en": "<p>Please consider the plagiarism guidelines of TU Wien when writing your seminar paper: <a href=\"https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf\" rel=\"nofollow\">https://www.tuwien.at/fileadmin/Assets/dienstleister/Datenschutz_und_Dokumentenmanagement/Plagiarism.pdf</a></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Kurze Tests im Anschluß an die Vorstellung der Methoden und Seminararbeit&nbsp;</p>",
            "en": "<p>Kurze Tests im Anschluß an die Vorstellung der Methoden und Seminararbeit&nbsp;</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            },
            "accompanyingCourses": {
                "course": "180779"
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "3365713",
                "1298405",
                "1026725",
                "2152749",
                "992585",
                "5861121",
                "6297029",
                "10684417"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=194078&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "NONE",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=194078-2020S",
        "language": {
            "de": "Englisch",
            "en": "English"
        }
    },
    {
        "courseNumber": "194082",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Technik für Menschen 2040",
            "en": "Technology for People 2040"
        },
        "objective": {
            "de": null,
            "en": null
        },
        "teachingContent": {
            "de": "<p>Wissenschaft, Technologie und Gesellschaft sind eng miteinander verflochten. Wissenschaft und Technologie bilden das Fundament unserer modernen Gesellschaft und werden in einer Welt mit 9 bis 11 Milliarden Menschen eine noch größere Rolle spielen. So erscheint einerseits die Bedeutung von Wissenschaft und Technologie bei der Entwicklung und dem Fortschritt unserer Gesellschaften unbestreitbar, andererseits sind unsere Lebensgrundlagen&nbsp; durch die unbeabsichtigten Folgen von Technologie, wachsenden Ungleichheiten und einer Wirtschaft gefährdet, deren Wachstum mit Umweltzerstörung verbunden ist.</p> \n<p>Von den neun »planetaren Grenzen«, die einen »sicheren Betriebsraum für die Menschheit« definieren, wurden einige bereits deutlich überschritten: Klimawandel, Biosphärenintegrität, biogeochemische Strömungen und Landnutzungsänderungen. Andere Innovationen wie künstliche Intelligenz, Automatisierung und Digitalisierung werden tiefgreifende Auswirkungen auf alle Aspekte unseres Lebens, unserer Arbeit, der Art und Weise, wie wir unsere Gesellschaften regieren und Kriege führen, zeigen. Synthetische Biologie, Nanotechnologie, neue Materialien und Produktionstechnologien könnten die Art und Weise, wie wir mit der physikalischen und biologischen Welt umgehen, grundlegend verändern.</p> \n<p>Alle genannten Technologien, und viele, die noch zu erwarten sind, bieten erhebliche Chancen, aber auch Gefahren.</p> \n<p>In dieser Vorlesung werden wir globale Megatrends diskutieren. Wir werden überlegen, wie wir mit Wissenschaft und Technik umgehen müssen, damit sie einer positive Zukunft der Menschheit dienen. Was kann dabei der Beitrag und unsere Verantwortung als zukünftige Wissenschafter und Ingenieure, als Manager und als Mitglieder der Gesellschaft sein?</p> \n<p>Was darf schließlich die Gesellschaft von den Absolventen einer Technischen Universität im 21. Jahrhundert erwarten? Technische Exzellenz ist ohne Zweifel notwendig, aber wir sollten ambitionierter sein:</p> \n<ul> \n <li><span>kritisches Denken und Bewerten der Folgen der Technik, insbesondere im eigenen Arbeitsbereich.</span></li> \n <li>Fokussierung auf wichtige und sinnvolle Bereiche für die Gesellschaft: Arbeiten die besten Menschen an den wichtigsten Problemen? Was ist ihre Rolle? Wo leisten Sie den größten Beitrag?</li> \n <li>Fähigkeit, eigenes Fachwissen und Konsequenzen der Technologie mit Nicht-Experten, Management und anderen Interessengruppen zu kommunizieren.</li> \n <li>Fähigkeit, Teams und Mitarbeiter auch unter sehr schwierigen Bedingungen zu führen, zu führen und zu motivieren.</li> \n</ul>",
            "en": "<p>Science, technology and society are intertwined. Science and technology formed the foundation of our modern society and will play an even bigger part in a world with 9 to 11 billion people on this planet.&nbsp; The pivotal role of science and technology in the development and advancement of our societies is undeniable. However, our very livelihoods are now under threat by the unintended consequences of technology, growing inequalities, and an economy whose growth is coupled with environmental degradation.</p> \n<p>Of the nine planetary boundaries, which define a “safe operating space for humanity”, some have already been critically exceeded: climate change, biosphere integrity, biogeochemical flows and land system change.</p> \n<p>Other innovations such as artificial intelligence, automation and digitalisation will have profound impacts on all aspects of our lives, work, the way we govern our societies and conduct wars. Synthetic biology, nanotechnology, new materials and production technologies could fundamentally change the way we interact with the physical and biological world.</p> \n<p>All of these technologies provide significant opportunities, but also threats.</p> \n<p>In this lecture we will be discussing the mega trends that we should be mindful of, and how we could envision a positive future in which technology and science serve humanity. To fulfil that vision, what should be our contribution and our responsibility as future scientists and engineers, as managers and as members of society?</p> \n<p>Finally, what do we expect from alumni of a technical university in the 21st century? Technical excellence is certainly required, however we should reach for more:</p> \n<ul> \n <li><span>critical thinking and assessment of the consequences of technology, especially in own field of work</span></li> \n <li>focusing on important and meaningful areas for society: are the best people working on the most important problems? what is your contribution? where do you contribute the most?</li> \n <li>ability to communicate own expertise and consequences of technology with non-experts, management and other stakeholder</li> \n <li>capability to lead, manage and motivate teams and co-workers even under very challenging conditions</li> \n</ul>"
        },
        "additionalInformation": {
            "de": "<p>Vorlesung und Diskussionen finden in Deutsch statt. Seminararbeit kann in Deutsch oder Englisch verfasst werden.</p> \n<p>Podcast: <a href=\"https://podcast.zukunft-denken.eu\" rel=\"nofollow\">https://podcast.zukunft-denken.eu</a> Lecturer Homepage: <a href=\"http://www.schatten.info\" rel=\"nofollow\">http://www.schatten.info</a></p>",
            "en": "<p>Lecture and discussions are in German. Term paper can be written in German or English.</p> \n<p>&nbsp;</p> \n<p>Podcast: <a href=\"https://podcast.zukunft-denken.eu\" rel=\"nofollow\">https://podcast.zukunft-denken.eu</a> Lecturer Homepage: <a href=\"http://www.schatten.info\" rel=\"nofollow\">http://www.schatten.info</a></p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Der Leistungsnachweis erfolgt durch Beurteilung verschiedener Aktivitäten der Studierenden:</p> \n<ul> \n <li>Teilnahme an Diskussionen</li> \n <li>Kurz-Präsentation eigener Erkenntnisse und Szenarien</li> \n <li>Kritische Auseinandersetzung mit ausgewählter Literatur</li> \n <li>Kritische und konstruktive Beurteilung eingebrachter Thesen des Vortragenden sowie anderer Teilnehmer</li> \n <li>Seminararbeit und Szenario-Entwicklung</li> \n</ul>",
            "en": "<p>Marking follows a sum of different activities</p> \n<ul> \n <li>participation in discussions</li> \n <li>classroom presentations of findings and scenarios</li> \n <li>constructive criticism of thesis of other participants and the lecturer</li> \n <li>term paper and scenario development</li> \n</ul>"
        },
        "related": {
            "recommendation": {
                "de": "<p>Kein besonderes Vorwissen ist erforderlich.&nbsp;<span>Erwartet wird allerdings das Interesse, sich interdisziplinär mit den wichtigsten Herausforderungen und Chancen unserer Zeit auseinanderzusetzen, sowie die Bereitschaft, aktiv in der Lehrveranstaltung mitzuwirken.</span></p>",
                "en": "<p>No specific prior knowledge is expected.&nbsp;<span>What is expected though is interest to engange with main challenges and opportunities of our time in an interdisciplinary way and the willingness to actively contribute.</span></p>"
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "3365713",
                "2642317"
            ]
        },
        "tutors": null,
        "instituteCode": "E194",
        "instituteName": {
            "de": "Institut für Information Systems Engineering",
            "en": "Institute of Information Systems Engineering"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=194082&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=194082-2020S",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    },
    {
        "courseNumber": "195079",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Fundamental research methods for doctoral students",
            "en": "Fundamental research methods for doctoral students"
        },
        "objective": {
            "de": "<p>This course will explore the fundamental research methods in Computer Science. It aims to provide a basic understanding of important resarch methods and how to critically apply these to advanced research.</p>",
            "en": "<p>This course will explore the fundamental research methods in Computer Science. It aims to provide a basic understanding of important resarch methods and how to critically apply these to advanced research.</p>"
        },
        "teachingContent": {
            "de": "<h1>Presentations with physical attendance of students have to be cancelled.</h1> \n<h1>We are working on alternatives like video recording or live stream. Stay tuned for updates and don't forget to watch for new material/assignments in TUWEL!</h1> \n<p><br><br></p> \n<p>This course consists of 5 parts:</p> \n<ol> \n <li>Introduction to methodologies and paradigms</li> \n <li>Overview of formal methods</li> \n <li>Overview of quantitative methods</li> \n <li>Overview of qualitative methods</li> \n <li>Overview of design methods<strong></strong></li> \n</ol> \n<p><strong>Schedule:</strong></p> \n<p>March 3: Organizational issues<br>March 10: Introduction to Methodologies and Paradigms <br>March 17: Overview of Formal Methods <br>March 24: Overview of Formal Methods <br>March 31: Overview of Quantitative Methods <br>April 21: Overview of Quantitative Methods <br>April 28: Overview of Quantitative Methods <br>May 5: Overview of Qualitative Methods <br>May 12: Overview of Qualitative Methods <br>May 19: Overview of Design Methods<br>May 26: Overview of Design Methods<br>June 16: Overview of Qualitative Methods (date might be shifted)</p>",
            "en": "<h1>Presentations with physical attendance of students have to be cancelled.</h1> \n<h1>We are working on alternatives like video recording or live stream. Stay tuned for updates and don't forget to watch for new material/assignments in TUWEL!</h1> \n<p><br><br></p> \n<p>This course consists of 5 parts:</p> \n<ol> \n <li>Introduction to methodologies and paradigms</li> \n <li>Overview of formal methods</li> \n <li>Overview of quantitative methods</li> \n <li>Overview of qualitative methods</li> \n <li>Overview of design methods</li> \n</ol> \n<p><strong>Schedule:</strong></p> \n<p>March 3: Organizational issues</p> \n<p>March 10: Introduction to Methodologies and Paradigms <br>March 17: Overview of Formal Methods <br>March 24: Overview of Formal Methods <br>March 31: Overview of Quantitative Methods <br>April 21: Overview of Quantitative Methods <br>April 28: Overview of Quantitative Methods <br>May 5: Overview of Qualitative Methods <br>May 12: Overview of Qualitative Methods <br>May 19: Overview of Design Methods<br>May 26: Overview of Design Methods<br>June 16: Overview of Qualitative Methods (date might be shifted)</p>"
        },
        "additionalInformation": {
            "de": "<p>This is a&nbsp;<strong>Fundamental PhD Course</strong>&nbsp;of the Faculty of Informatics for doctoral students.&nbsp;</p> \n<p>First-year doctoral students are advised to take this course, as its content may help them to prepare their PhD proposal.</p> \n<p>Doctoral students in Computer Science have admission priority to this course.</p> \n<p>In case of general questions (which are not specific to one of the course parts) please contact Andreas Steininger via e-mail: steininger@ecs.tuwien.ac.at.</p>",
            "en": "<p>This is a&nbsp;<strong>Fundamental PhD Course</strong>&nbsp;of the Faculty of Informatics for doctoral students.&nbsp;</p> \n<p>First-year doctoral students are advised to take this course, as its content may help them to prepare their PhD proposal.</p> \n<p>Doctoral students in Computer Science have admission priority to this course.</p> \n<p>In case of general questions (which are not specific to one of the course parts) please contact <br>Andreas Steininger via e-mail: steininger@ecs.tuwien.ac.at.</p>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>The course parts will be graded with an assignment for each part. The final grade is calculated as the average grade of the assignments.</p> \n<p>Students will receive a positive grade only if the following requirements are fulfilled:</p> \n<ul> \n <li>Attendance to the lectures (if attendance is not possible, if should be communicated via e-mail to the respective lecturer and C.Schmid via clarissa.schmid@tuwien.ac.at<strong> before</strong> the lecture).</li> \n <li>positive grade in every course part</li> \n <li>Submission of all assignments.&nbsp;The type of assignment will be defined by the lecturers. In case of written assignments these should be written in English and submitted via TUWEL. In case a presentation has to be done, attendance is compulsary on that date.</li> \n</ul>",
            "en": "<p>The course parts will be graded with an assignment for each part. The final grade is calculated as the average grade of the assignments.</p> \n<p>Students will receive a positive grade only if the following requirements are fulfilled:</p> \n<ul> \n <li>Attendance to the lectures (if attendance is not possible, if should be communicated via e-mail to the respective lecturer and C.Schmid via clarissa.schmid@tuwien.ac.at<strong> before</strong> the lecture).</li> \n <li>positive grade in every course part</li> \n <li>Submission of all assignments.&nbsp;The type of assignment will be defined by the lecturers. In case of written assignments these should be written in English and submitted via TUWEL. In case a presentation has to be done, attendance is compulsary on that date.</li> \n</ul>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "7275665",
                "1121293",
                "3365713",
                "571677",
                "10684417",
                "1069133",
                "17693177"
            ]
        },
        "tutors": null,
        "instituteCode": "E199",
        "instituteName": {
            "de": "Services Informatik",
            "en": "Services Informatics"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=195079&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?idnumber=195079-2020S",
        "language": {
            "de": "Englisch",
            "en": "English"
        }
    },
    {
        "courseNumber": "185A06",
        "semesterCode": "2020S",
        "courseType": "VU",
        "title": {
            "de": "Formale Modellierung",
            "en": "Formal Modelling"
        },
        "objective": {
            "de": "<p>Ziel der Lehrveranstaltung ist es, den Studierenden die wichtigsten formalen Spezifikationsmethoden zu vermitteln und sie zu befähigen, mit diesen Methoden mehrdeutige umgangssprachlich beschriebene Sachverhalte zu modellieren. Weiters lernen sie die formal-mathematischen Beschreibungen dieser Methoden zu lesen und zu verstehen, sodass sie selbständig ihr Wissen an Hand von Fachliteratur vertiefen können.</p>",
            "en": "<p>The aim of the course is to get the students to know the most relevant methods for formal specification, and to enable them to model real-world situations in a formal manner on the basis of ambigous natural language descriptions. Moreover the students learn to read and understand the formal-mathematical characterisations of these methods such that they can extend their knowledge by specialised literature on their own.</p>"
        },
        "teachingContent": {
            "de": "<p>Textuelle Spezifikationssprachen:</p> \n<ul> \n <li>Aussagenlogik</li> \n <li>Prädikatenlogik</li> \n <li>Reguläre Ausdrücke</li> \n <li>Kontextfreie Grammatiken</li> \n</ul> \n<p>Graphische Spezifikationssprachen:</p> \n<ul> \n <li>Endliche Automaten</li> \n <li>Petri-Netze</li> \n</ul> \n<p>Für jede dieser Modellierungssprachen werden folgende Aspekte diskutiert: &nbsp;</p> \n<ul> \n <li>Syntax: Was ist eine zulässige Äußerung in dieser Sprache?</li> \n <li>Semantik: Was bedeutet jede der zulässigen Äußerungen?</li> \n <li>Ausdrucksstärke: Was kann ausgedrückt werden, was nicht?</li> \n <li>Verwendung: Wie setzt man die Sprache zur Modelllierung ein?</li> \n</ul>",
            "en": "<p>Textual specification languagse:</p> \n<ul> \n <li>Propositional logic</li> \n <li>Predicate logic</li> \n <li>Regular expressions</li> \n <li>Context-free grammars</li> \n</ul> \n<p>Graphical specification languages: &nbsp;</p> \n<ul> \n <li>Finite-state machines (automata)</li> \n <li>Petri nets</li> \n</ul> \n<p>For each of these modeling languages we discuss the following aspects: &nbsp;</p> \n<ul> \n <li>Syntax: What are the admissible utterances of the language?</li> \n <li>Semantics: What is the meaning of admissible utterances?</li> \n <li>Expressive power: Which situations can be expressed adequately, which cannot?</li> \n <li>Applications: How is the language used to model concrete situations?</li> \n</ul> \n<p>&nbsp;</p> \n<p>&nbsp;</p>"
        },
        "additionalInformation": {
            "de": "<h3><strong>Aufwandsabschätzung</strong></h3> \n<pre>18.0 h Vorlesungsbesuch (9 Tage x 2h)<br>21.0 h 2 Übungsblätter (2 x 10.5h)<br> 8.0 h Vorbereitung auf 1.Abgabegespräch<br> 1.0 h 1.Abgabegespräch<br>&nbsp;8.0 h Vorbereitung auf 2.Abgabegespräch<br> 1.0 h 2.Abgabegespräch<br>16.0 h Vorbereitung auf Abschlusstest<br> 2.0 h Abschlusstest<br>-------------------------------------------------<br>75.0 h = 3 Ects</pre>",
            "en": "<h3><strong>Ects Breakdown<br></strong></h3> \n<pre>18.0 h attendance of lecture (9 days x 2h)<br>21.0 h 2 exercise sheets (2 x 10.5h)<br> 8.0 h preparation for first oral exam (Abgabegespräch)<br> 1.0 h first oral exam (Abgabegespräch)<br> 8.0 h preparation for second oral exam (Abgabegespräch)<br> 1.0 h second oral exam (Abgabegespräch)<br>16.0 h preparation for final test<br> 2.0 h final test<br>-----------------------------------------------<br>75.0 h = 3 Ects</pre>"
        },
        "lectureNotes": {
            "de": null,
            "en": null
        },
        "examinationModalities": {
            "de": "<p>Die Gesamtbeurteilung ergibt sich aus den Leistungen, die bei <em>zwei Übungsblättern</em> (zusammen max. 10 Punkte), zwei <em>Abgabegespräch</em>en (jeweils max. 10 Punkte) sowie beim schriftlichen <em>Abschlusstest</em> (max. 50 Punkte) erbracht werden. Insgesamt können somit 10+2*10+50=80 Punkte erzielt werden. Für eine positive Gesamtbeurteilung sind mindestens 25 Punkte beim Abschlusstest und eine Gesamtpunkteanzahl von mindestens 40 notwendig. Positive Noten ergeben sich aus der Gesamtpunktezahl nach folgendem Schlüssel:</p> \n<ul> \n <li>40-49 Punkte: genügend (4)</li> \n <li>50-59 Punkte: befriedigend (3)</li> \n <li>60-69 Punkte: gut (2)</li> \n <li>70-80 Punkte: sehr gut (1)</li> \n</ul> \n<p>Zur Absolvierung des Abschlusstests werden vier Termine angeboten: Im Juni, September, November und Jänner (die genauen Termine entnehmen Sie bitte dem Abschnitt <em>Prüfungen</em>). Es können maximal zwei der vier Termine genutzt werden, wobei das bessere Ergebnis zählt.</p>",
            "en": "<p>The final grade is determined on the basis of&nbsp; the submitted exercises (in total 10 points), two oral exams (10 points each),&nbsp; and the written final test (50 points), giving a total of 10+2*10+50=80 points.&nbsp; To pass the course you need at least 25 points at the final test and at least 40 points in total. Positive grades are determined from the sum of points according to the following scale:</p> \n<ul> \n <li>40-49 points: passed (4)</li> \n <li>50-59 points: satisfactory (3)</li> \n <li>60-69 points: good (2)</li> \n <li>70-80 points: excellent (1)</li> \n</ul> \n<p>We offer four dates to take the final exam: in June, September, January and February (for the precise dates see the section <em>Exams</em>). You may take the test at most twice, with the better result superseding the worse one.</p>"
        },
        "related": {
            "recommendation": {
                "de": null,
                "en": null
            }
        },
        "weeklyHours": "2.0",
        "lecturers": {
            "oid": [
                "468649",
                "1442505",
                "2114465",
                "1188865",
                "3365457",
                "8620017"
            ]
        },
        "tutors": {
            "oid": [
                "15486789",
                "18050357",
                "18050709",
                "11916097",
                "13585041",
                "12494405",
                "14268909",
                "17691229",
                "17922293",
                "18050761",
                "13009161",
                "16246969",
                "10835405",
                "12077853",
                "13708581"
            ]
        },
        "instituteCode": "E192",
        "instituteName": {
            "de": "Institut für Logic and Computation",
            "en": "Institute of Logic and Computation"
        },
        "url": "https://tiss.tuwien.ac.at/course/courseDetails.xhtml?courseNr=185A06&semester=2020S",
        "uses54EctsRule": "false",
        "registration": "TISS",
        "eLearning": "https://tuwel.tuwien.ac.at/course/view.php?id=18991",
        "language": {
            "de": "Deutsch",
            "en": "German"
        }
    }
]